{
    "Órfhlaith Begley": {
        "unis": "Queen's University Belfast",
        "sentence": "She studied Law and Politics at the Queen's University Belfast."
    },
    "Mickey Brady": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Gregory Campbell": {
        "unis": "University of Ulster",
        "sentence": "He was educated at the city's technical college and at the University of Ulster."
    },
    "Jeffrey Donaldson": {
        "unis": "Castlereagh College",
        "sentence": "He attended Kilkeel High School, where he excelled at debating, then Castlereagh College."
    },
    "Colum Eastwood": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stephen Farry": {
        "unis": "Queen's University Belfast",
        "sentence": "He graduated from Queen's University, Belfast in 1992 with a BSSc in Politics and a PhD in International Relations in 2000."
    },
    "John Finucane": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Michelle Gildernew": {
        "unis": "University of Ulster",
        "sentence": "Born in Dungannon, Gildernew attended St Catherine's College Armagh and later the University of Ulster, Coleraine."
    },
    "Paul Girvan": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Claire Hanna": {
        "unis": "Open University Queen's University Belfast",
        "sentence": "Hanna holds a Bachelors of Science (BSc) with honours in International Relations from the Open University and a master's degree in law (LLM) from Queen's University Belfast."
    },
    "Chris Hazzard": {
        "unis": "Queen's University Belfast",
        "sentence": "The eldest of four siblings, he attended Our Lady and St Patrick's College, Knock, before going to Queen's University Belfast.Hazzard is a Gaelic Athletic Association member and PhD candidate at Queen's University Belfast."
    },
    "Carla Lockhart": {
        "unis": "Ulster University",
        "sentence": "She attended Aughnacloy High School, before attending Armagh Tech (now part of Southern Regional College) and then obtaining a business degree from the University of Ulster."
    },
    "Paul Maskey": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Francie Molloy": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ian Paisley Jr": {
        "unis": "Queen's University Belfast",
        "sentence": "After leaving primary school, Paisley was educated at Shaftesbury House College, and then in the sixth form at Methodist College Belfast, before gaining admission to Queen's University Belfast.The summer of 1994 was the last year Queen's University Belfast played the British national anthem; Paisley responded by playing the anthem on a tape recorder during his winter graduation."
    },
    "Gavin Robinson": {
        "unis": "Ulster University",
        "sentence": "He attended Grosvenor Grammar School in East Belfast, and then Ulster University where he obtained a degree in law and government, before attending Queen's University Belfast, where he attained a Masters in Irish Politics before commencing practice as a barrister."
    },
    "Jim Shannon": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Sammy Wilson": {
        "unis": "Queen's University Belfast",
        "sentence": "He was educated at Methodist College in Belfast, and then went on to study Economics and Politics at both Queen's University of Belfast and Stranmillis University College."
    }
}