{
    "Hannah Bardell": {
        "unis": "University of Stirling",
        "sentence": "She attended Broxburn Academy and the University of Stirling."
    },
    "Mhairi Black": {
        "unis": "University of Glasgow",
        "sentence": "Born in Paisley in 1994, Black was educated at Lourdes Secondary School, Glasgow, and the University of Glasgow, where she was awarded a first-class honours degree in Politics and Public policy in June 2015.Black became a member of Parliament for Paisley and Renfrewshire South in the 2015 general election while still a final year undergraduate student at the University of Glasgow."
    },
    "Ian Blackford": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Kirsty Blackman": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Steven Bonnar": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Bowie": {
        "unis": "Britannia Royal Naval College|University of Aberdeen",
        "sentence": "After leaving school, he joined the Royal Navy and attended Britannia Royal Naval College before serving as an officer, remaining on the rank of Sub-Lieutenant.After leaving the Navy, Bowie studied History and Politics at the University of Aberdeen, where he was a member of the Aberdeen University Royal Naval Unit and where he was elected Chairman of the University of Aberdeen Conservative and Unionist Association for the 2012/13 academic year.After graduating from the University of Aberdeen, Bowie was employed as a Military Projects Coordinator for Westhill-based diving equipment supplier Divex."
    },
    "Deidre Brock": {
        "unis": "Curtin University|Western Australian Academy of Performing Arts",
        "sentence": "She studied English at Curtin University and graduated with a BA, then studied acting at the Western Australian Academy of Performing Arts.She studied English at Curtin University and graduated with a BA, then studied acting at the Western Australian Academy of Performing Arts."
    },
    "Alan Brown": {
        "unis": "University of Glasgow",
        "sentence": "He subsequently attended Glasgow University, where he graduated with an honours degree in civil engineering."
    },
    "Amy Callaghan": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Lisa Cameron": {
        "unis": "University of Strathclyde|University of Stirling|University of Glasgow",
        "sentence": "She obtained a BSc in Psychology from the University of Strathclyde, an MSc in Psychology and Health from the University of Stirling and a doctorate in Clinical Psychology from the University of Glasgow.She attended the University of Strathclyde where she graduated with a BSc.She obtained a BSc in Psychology from the University of Strathclyde, an MSc in Psychology and Health from the University of Stirling and a doctorate in Clinical Psychology from the University of Glasgow.degree in Psychology and Health from the University of Stirling before gaining her DClinPsy. degree from the University of Glasgow.She obtained a BSc in Psychology from the University of Strathclyde, an MSc in Psychology and Health from the University of Stirling and a doctorate in Clinical Psychology from the University of Glasgow.degree in Psychology and Health from the University of Stirling before gaining her DClinPsy. degree from the University of Glasgow."
    },
    "Alistair Carmichael": {
        "unis": "University of Aberdeen",
        "sentence": "He returned to education at the University of Aberdeen, where he gained an LLB in 1992, qualifying as a solicitor in 1993."
    },
    "Wendy Chamberlain": {
        "unis": "University of Edinburgh",
        "sentence": "She studied English at the University of Edinburgh, and was a member of the Edinburgh University Footlights, a student-run musical-theatre group, and performed in a show with the group at the Edinburgh Festival Fringe."
    },
    "Douglas Chapman": {
        "unis": "Edinburgh Napier University",
        "sentence": "No Data"
    },
    "Joanna Cherry": {
        "unis": "University of Edinburgh",
        "sentence": "She was educated at Holy Cross primary school, then at St Margaret's Convent School in Edinburgh and the University of Edinburgh.She also worked as a part-time tutor in constitutional law, family law and civil court practice at the University of Edinburgh from 1990 to 1996.Cherry was admitted as an advocate in 1995, with a particular interest in employment and industrial relations, health and safety, mental health, personal injury and professional negligence."
    },
    "Ronnie Cowan": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Angela Crawley": {
        "unis": "University of Stirling|University of Glasgow",
        "sentence": "She studied Politics at the University of Stirling, graduating with a BA degree.After being elected to Parliament,  she received an LLB degree in law from the University of Glasgow."
    },
    "Martyn Day": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Martin Docherty": {
        "unis": "Glasgow Metropolitan College|University of Essex|Glasgow School of Art",
        "sentence": "He subsequently obtained a degree in Politics from the University of Essex and attended the Glasgow School of Art for his master's degree.He subsequently obtained a degree in Politics from the University of Essex and attended the Glasgow School of Art for his master's degree."
    },
    "Dave Doogan": {
        "unis": "University of Dundee",
        "sentence": "Doogan left his successful career in the Ministry of Defence in 2007 to pursue a career in politics, studying at the University of Dundee."
    },
    "Allan Dorans": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "David Duguid": {
        "unis": "Robert Gordon University",
        "sentence": "He was educated at Banff Academy and Robert Gordon University, where he studied chemistry."
    },
    "Marion Fellows": {
        "unis": "Heriot-Watt University",
        "sentence": "Fellows studied Accountancy and Finance at Heriot Watt University."
    },
    "Margaret Ferrier": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stephen Flynn": {
        "unis": "University of Dundee",
        "sentence": "He studied at the University of Dundee, graduating with an undergraduate Master of Arts (MA Hons) in the study of history and politics, and an Master of Letters (MLitt) degree in the study of international politics and security studies."
    },
    "Patricia Gibson": {
        "unis": "University of Glasgow",
        "sentence": "She received a BA (Hons) and MA (Hons) in English and Politics from the University of Glasgow."
    },
    "Patrick Grady": {
        "unis": "University of Strathclyde",
        "sentence": "He was brought up in Inverness and was educated at Inverness Royal Academy, before attending the University of Strathclyde."
    },
    "Peter Grant": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Neale Hanvey": {
        "unis": "City University, London",
        "sentence": "No Data"
    },
    "Drew Hendry": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stewart Hosie": {
        "unis": "Abertay University",
        "sentence": "No Data"
    },
    "Alister Jack": {
        "unis": "Heriot-Watt University",
        "sentence": "He later attended Heriot-Watt University."
    },
    "Christine Jardine": {
        "unis": "University of Glasgow",
        "sentence": "Jardine was educated at Braidfield High School and the University of Glasgow, where she graduated with a MA (Hons).She is a former journalist, who worked for BBC Scotland and was editor of the Press Association in Scotland."
    },
    "John Lamont": {
        "unis": "University of Glasgow",
        "sentence": "He was educated at Kilwinning Academy and studied at the School of Law of the University of Glasgow where he gained a first class honours degree."
    },
    "Chris Law": {
        "unis": "University of St Andrews",
        "sentence": "Law later trained as a French chef, then went to the University of St Andrews where he received a degree in Social Anthropology."
    },
    "David Linden": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Kenny MacAskill": {
        "unis": "University of Edinburgh",
        "sentence": "Born in Edinburgh and educated at Linlithgow Academy, MacAskill studied law at the University of Edinburgh and was a senior partner in a law firm in Glasgow.==\nMacAskill was born in Edinburgh and was educated at Linlithgow Academy before studying law at the University of Edinburgh, gaining an LLB (Hons) degree."
    },
    "Angus MacNeil": {
        "unis": "University of Strathclyde",
        "sentence": "=\nMacNeil was educated at Castlebay Secondary School on the island of Barra and the Nicolson Institute in Stornoway on the Isle of Lewis before attending Strathclyde University where he played shinty and in 1992 gained a degree in civil engineering."
    },
    "Stewart McDonald": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stuart McDonald": {
        "unis": "University of Edinburgh",
        "sentence": "He studied at the University of Edinburgh between 1996 and 2001, where he graduated from with a 2:1 Bachelor of Law (Hons), and a Diploma in Legal Practice.During his time at the University of Edinburgh, McDonald studied European and Comparative Law while on an ERASMUS year at the University of Leuven, between 1997 and 1998.After graduating from university, McDonald worked as a Legal Trainee with Simpson and Marwick Solicitors, between October 2001 and July 2003, before he went to work for NHS Scotland's Central Legal Office, as a Solicitor – a position he held between July 2003 and November 2005."
    },
    "Anne McLaughlin": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "John McNally": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Carol Monaghan": {
        "unis": "University of Strathclyde",
        "sentence": "Monaghan studied at Strathclyde University, graduating with a BSc (Hons) in Laser Physics and Optoelectronics in 1993."
    },
    "David Mundell": {
        "unis": "University of Edinburgh|University of Strathclyde",
        "sentence": "He attended Lockerbie Academy before reading Law at the University of Edinburgh (MA), also gaining a Diploma in Legal Practice (Dip LP)."
    },
    "Ian Murray": {
        "unis": "University of Edinburgh",
        "sentence": "Upon completing his secondary school education, Murray read Social Policy and Law at the University of Edinburgh's Academy of Government, graduating with an honours degree (M.A. Hons.) at the age of twenty."
    },
    "Gavin Newlands": {
        "unis": "James Watt College",
        "sentence": "While enrolled at James Watt College, Newlands was offered a promotion in his part-time job at McDonalds, and dropped out of college."
    },
    "John Nicolson": {
        "unis": "University of Glasgow|Harvard University",
        "sentence": "He graduated from the University of Glasgow with a MA (Hons.) in English literature and Politics."
    },
    "Brendan O'Hara": {
        "unis": "University of Strathclyde",
        "sentence": "Born in Glasgow, O'Hara was educated at St. Andrew's Secondary, Carntyne, and attended Strathclyde University from where he graduated with a 2:1 in Economic History and Modern History."
    },
    "Kirsten Oswald": {
        "unis": "University of Glasgow",
        "sentence": "She studied history at the University of Glasgow graduating with an MA(Hons) in 2005."
    },
    "Anum Qaisar": {
        "unis": "University of Stirling",
        "sentence": "Is your dad a terrorist?\"She studied politics at the University of Stirling."
    },
    "Douglas Ross": {
        "unis": "Scottish Agricultural College",
        "sentence": "After graduating from the Scottish Agricultural College, he worked on a dairy farm.In childhood he first attended Alves Primary School and the state secondary Forres Academy before going on to study agriculture at the Scottish Agricultural College."
    },
    "Tommy Sheppard": {
        "unis": "University of Aberdeen",
        "sentence": "He was educated at Coleraine Academical Institution before attending the University of Aberdeen to study medicine."
    },
    "Alyn Smith": {
        "unis": "University of Leeds|Nottingham Trent University",
        "sentence": "After returning to the UK in 1986, he studied law and European law at the University of Leeds, receiving his LLB (Hons) degree in 1994.The following year, he graduated from Nottingham Law School at Nottingham Trent University, and received a Diploma in Legal Practice."
    },
    "Chris Stephens": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jamie Stone": {
        "unis": "University of St Andrews",
        "sentence": "He studied History and Geology at the University of St Andrews and graduated in 1977.Stone is married with three children, one son and two daughters, both of whom also attended the University of St Andrews."
    },
    "Alison Thewliss": {
        "unis": "University of Aberdeen",
        "sentence": "Thewliss attended Carluke High School and studied Politics and International Relations at the University of Aberdeen."
    },
    "Owen Thompson": {
        "unis": "Edinburgh Napier University",
        "sentence": "He studied accounting and finance at Edinburgh Napier University."
    },
    "Richard Thomson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Philippa Whitford": {
        "unis": "University of Glasgow",
        "sentence": "She was educated at Wood Green: St Angela's Providence Convent Secondary School in London and Douglas Academy in Milngavie, before studying at the University of Glasgow, where she graduated with medical degrees."
    },
    "Pete Wishart": {
        "unis": "Moray House College of Education",
        "sentence": "No Data"
    }
}