{
    "Diane Abbott": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Debbie Abrahams": {
        "unis": "University of Salford|University of Liverpool",
        "sentence": "She was privately educated, going on to study biochemistry and physiology at the University of Salford; her early employment was as a community worker for a charity in Wythenshawe in south Manchester, where she set up job training programmes for teenagers.She later studied for a master's degree at the University of Liverpool.She was Director of the International Health Impact Assessment Consortium at the University of Liverpool between 2006 and 2010."
    },
    "Bim Afolami": {
        "unis": "University College, Oxford",
        "sentence": "Afolami was privately educated both at Bishopsgate School and at Eton College, and then attended University College, Oxford, where he read Modern History, served as Librarian of the Oxford Union Society and played football for the university team."
    },
    "Adam Afriyie": {
        "unis": "Wye College",
        "sentence": "He was educated at Addey and Stanhope School in New Cross, and earned a bachelor's degree in agricultural economics from Wye College in 1987.Afriyie has seven half-siblings and one brother."
    },
    "Nickie Aiken": {
        "unis": "University of Exeter",
        "sentence": "Aiken was educated at Radyr Comprehensive School, and the University of Exeter, from where she graduated with a BA in Sociology in 1991."
    },
    "Peter Aldous": {
        "unis": "University of Reading",
        "sentence": "He was privately educated at Harrow School and graduated from the University of Reading with a degree in Land Management in 1982.Before his election Aldous was as a chartered surveyor in Norwich."
    },
    "Rushanara Ali": {
        "unis": "St John's College, Oxford",
        "sentence": "The first in her family to go to university, Ali studied Philosophy, Politics and Economics at St John's College, Oxford."
    },
    "Tahir Ali": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Lucy Allan": {
        "unis": "Durham University|Kingston University",
        "sentence": "Allan was educated at Durham University and Kingston Law School."
    },
    "Rosena Allin-Khan": {
        "unis": "Brunel University|Lucy Cavendish College, Cambridge",
        "sentence": "Instead, she studied medical biochemistry at Brunel University, funding her education through a series of part-time jobs and establishing a strong record.She was accepted to study medicine at Lucy Cavendish College, Cambridge, where she was assisted by scholarships."
    },
    "Mike Amesbury": {
        "unis": "Bradford University|University of Central England",
        "sentence": "He was educated at Ilkley College and the University of Central England."
    },
    "Fleur Anderson": {
        "unis": "University of York|The Open University",
        "sentence": "She graduated with a Bachelor of Science degree in Politics from the University of York in 1993."
    },
    "Lee Anderson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stuart Anderson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stuart Andrew": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Caroline Ansell": {
        "unis": "University of Sussex|University of London|École supérieure de commerce",
        "sentence": "She attended university at Royal Holloway, University of London, to study a Bachelor of Arts in French.Ansell also studied business at the private university École supérieure de commerce and, aged 30, gained a master's degree in education from the University of Brighton in 2001.Ansell worked for a number of years as a French teacher, exclusively in private schools."
    },
    "Edward Argar": {
        "unis": "Oriel College, Oxford",
        "sentence": "Argar was born in Ashford and educated at the Harvey Grammar School, before earning a 2:1 in modern history at Oriel College, Oxford."
    },
    "Jonathan Ashworth": {
        "unis": "Durham University",
        "sentence": "He read politics and philosophy at the University of Durham."
    },
    "Victoria Atkins": {
        "unis": "Corpus Christi College,Cambridge|Middle Temple",
        "sentence": "Atkins was called to the bar (Middle Temple) in 1998."
    },
    "Gareth Bacon": {
        "unis": "University of Kent",
        "sentence": "He studied at St. Mary's and St. Joseph's School in Sidcup, then at the University of Kent at Canterbury, where he was awarded a Bachelor of Arts honours degree in Politics and Government in 1996."
    },
    "Richard Bacon": {
        "unis": "London School of Economics",
        "sentence": "Bacon was privately educated at The King's School, Worcester and then studied at the London School of Economics and Political Science, gaining a first in Politics and Economics."
    },
    "Kemi Badenoch": {
        "unis": "University of Sussex Birkbeck, University of London",
        "sentence": "Badenoch studied Computer Systems Engineering at the University of Sussex, completing a Master of Engineering (MEng) degree in 2003.She initially worked within the IT sector, first as a software engineer at Logica (later CGI Group) from 2003 to 2006.While working there she read Law part-time at Birkbeck, University of London, graduating as Bachelor of Laws (LLB) in 2009."
    },
    "Shaun Bailey": {
        "unis": "Aberystwyth University|University of the West of England",
        "sentence": "Bailey studied Law and French at Aberystwyth University, graduating with an LLB and later obtained a master's degree in Legal Practice at the University of the West of England in Bristol.Bailey studied Law and French at Aberystwyth University, graduating with an LLB and later obtained a master's degree in Legal Practice at the University of the West of England in Bristol."
    },
    "Siobhan Baillie": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Duncan Baker": {
        "unis": "Nottingham Trent University",
        "sentence": "He studied business at Nottingham Trent University, then qualified as a chartered accountant, and worked as a finance director."
    },
    "Steve Baker": {
        "unis": "University of Southampton|St Cross College, Oxford",
        "sentence": "He was educated at Poltair School in St Austell and St Austell Sixth Form College followed by the University of Southampton where he gained a BEng in Aerospace Engineering.He later studied at St Cross College, Oxford, where he earned an MSc in Computation."
    },
    "Harriett Baldwin": {
        "unis": "Lady Margaret Hall, Oxford|Mc|Gill University",
        "sentence": "Baldwin studied French and Russian at Lady Margaret Hall, Oxford.She also obtained an MBA from McGill University in Montreal, Canada.She also obtained an MBA from McGill University in Montreal, Canada."
    },
    "Steve Barclay": {
        "unis": "Peterhouse, Cambridge",
        "sentence": "He then read history at Peterhouse, Cambridge, before qualifying as a solicitor through the College of Law.After his gap year, he read history at Peterhouse, Cambridge, graduating with a Bachelor of Arts (BA) degree in 1994."
    },
    "Paula Barker": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "John Baron": {
        "unis": "Jesus College, Cambridge",
        "sentence": "==\nJohn Baron was born in Redhill, Surrey, and was privately educated at the Queen's College, Taunton, followed by studies at Jesus College, Cambridge and at the Royal Military Academy Sandhurst."
    },
    "Margaret Beckett": {
        "unis": "Manchester College of Science and Technology",
        "sentence": "She was educated at the Notre Dame High School for Girls in Norwich, then at University of Manchester Institute of Science and Technology, where she took a degree in metallurgy.She joined the University of Manchester in 1966 as an experiment officer in its metallurgy department, and in 1970 went to work for the Labour Party as a researcher in industrial policy.In November 2017 she was awarded the honorary degree of Doctor of the University (D.Univ) from the University of Derby."
    },
    "Apsana Begum": {
        "unis": "Queen Mary University of London|SOAS University of London",
        "sentence": "Begum graduated with a BA in politics from Queen Mary University of London in 2011, and completed a postgraduate diploma in law and community leadership at SOAS University of London in 2012.From 2011 to 2013, she worked in the role of Executive Support and Admin for Tower Hamlets Council.She was a Workforce Diversity Project Officer for Tower Hamlets Homes from 2014 to 2015, and Equality and Diversity Officer for Queen Mary University of London from 2016 to 2018.Begum graduated with a BA in politics from Queen Mary University of London in 2011, and completed a postgraduate diploma in law and community leadership at SOAS University of London in 2012.From 2011 to 2013, she worked in the role of Executive Support and Admin for Tower Hamlets Council."
    },
    "Aaron Bell": {
        "unis": "St. John's College, Oxford",
        "sentence": "Bell graduated with a BA in 2001.Before his political career, Bell was a successful quizzer: he was part of the St John's College, Oxford team that were runners up in the 2000–01 series of University Challenge; he won the Krypton Factor in 2009; he was part of the Epicureans team that won Only Connect in 2010; he also won £25,000 on Deal or No Deal in 2006.Bell worked as a trading development manager from 2003 to 2006, being employed by Ladbrokes."
    },
    "Hilary Benn": {
        "unis": "University of Sussex",
        "sentence": "He studied Russian and Eastern European Studies at the University of Sussex and went on to work as a policy researcher for two trade unions, ASTMS and MSF.Benn attended Norland Place School, Westminster Under School, Holland Park School, and the University of Sussex where he graduated in Russian and Eastern European Studies."
    },
    "Scott Benton": {
        "unis": "University of Nottingham",
        "sentence": "Benton then studied Theology as an undergraduate at the University of Nottingham and was awarded a first class Bachelor of Arts degree."
    },
    "Paul Beresford": {
        "unis": "University of Otago",
        "sentence": "He moved to Nelson as a child, where he lived in Richmond, and attended Waimea College in Richmond before attending the University of Otago in Dunedin."
    },
    "Jake Berry": {
        "unis": "University of Sheffield and College of Law",
        "sentence": "==\nJames Berry was born on 29 December 1978 in Liverpool and privately educated at Liverpool College, before studying for a law degree at Sheffield University."
    },
    "Clive Betts": {
        "unis": "Pembroke College, Cambridge",
        "sentence": "He was state educated at the Longley School in Sheffield, King Edward VII School, Sheffield and Pembroke College, Cambridge, where he received a BA in Economics and Politics."
    },
    "Saqib Bhatti": {
        "unis": "London School of Economics and Political Science",
        "sentence": "Bhatti also holds an honorary doctorate from Aston University in Business Administration."
    },
    "Bob Blackman": {
        "unis": "University of Liverpool",
        "sentence": "After three maths A-levels Blackman studied maths and physics at the University of Liverpool and left with a Bachelor of Science degree."
    },
    "Olivia Blake": {
        "unis": "University of Sheffield",
        "sentence": "She studied Biomedical Science at the University of Sheffield."
    },
    "Paul Blomfield": {
        "unis": "St John's College, York",
        "sentence": "A member of the Labour Party, he was a Shadow Minister for Exiting the European Union from 2016 to 2020 and Shadow Minister for Brexit and European Union Negotiations from 2020 to 2021.Twice President of the Students' Union at St John's College, York, Blomfield was also a member of the National Executive Committees of both the National Union of Students and the Anti-Apartheid Movement, the latter from 1979 to 1994."
    },
    "Crispin Blunt": {
        "unis": "Royal Military Academy Sandhurst|University College, Durham|Cranfield School of Management",
        "sentence": "He was educated at Wellington College, and the Royal Military Academy Sandhurst, where he won the Queen's Medal, gaining a regular commission, before reading politics at University College, Durham between 1981 and 1984, where he was elected president of the Durham Union Society in 1983 and graduated with a 2:1 degree.He was educated at Wellington College, and the Royal Military Academy Sandhurst, where he won the Queen's Medal, gaining a regular commission, before reading politics at University College, Durham between 1981 and 1984, where he was elected president of the Durham Union Society in 1983 and graduated with a 2:1 degree.In 1991, he gained an MBA degree at the Cranfield School of Management."
    },
    "Gen Kitchen": {
        "unis": "Queen Mary University of London",
        "sentence": "She studied history and politics at Queen Mary University of London, and graduated in 2016."
    },
    "Peter Bottomley": {
        "unis": "Trinity College, Cambridge",
        "sentence": "After seven school changes before the age of 11, he was educated at a junior high school in Washington, D.C., and then Westminster School before studying economics at Trinity College, Cambridge, following his father, grandfather, father-in-law and father-in-law's father to the college."
    },
    "Ben Bradley": {
        "unis": "Nottingham Trent University",
        "sentence": "He subsequently attended Nottingham Trent University where he studied politics, graduating in 2013."
    },
    "Karen Bradley": {
        "unis": "Imperial College London",
        "sentence": "and she was educated at the local comprehensive and Imperial College London, graduating with a BSc in mathematics."
    },
    "Ben Bradshaw": {
        "unis": "University of Sussex",
        "sentence": "Bradshaw was educated at Thorpe Grammar School, followed by the University of Sussex where he read for a degree in German."
    },
    "Graham Brady": {
        "unis": "St Aidan's College, Durham",
        "sentence": "He was educated at Altrincham Grammar School for Boys, before studying Law at the University of Durham, at St Aidan's College, graduating with a Bachelor of Arts (BA) degree in 1989.Brady was highly active in politics as a student.He served as Chairman of the Durham University Conservative Association (DUCA) for the 1987–1988 academic year and was one of six students elected to represent Durham at the annual NUS conference.Brady met Victoria Lowther at Durham University."
    },
    "Suella Braverman": {
        "unis": "Queens' College, Cambridge|Panthéon-Sorbonne University",
        "sentence": "She attended the Uxendon Manor Primary School in Brent and the fee-paying Heathfield School, Pinner, on a partial scholarship, after which she read law at Queens' College, Cambridge.Braverman lived in France for two years, as an Erasmus Programme student and then as an Entente Cordiale Scholar, where she studied for a master's degree in European and French law at Panthéon-Sorbonne University."
    },
    "Jack Brereton": {
        "unis": "Keele University|University College London",
        "sentence": "He attended Keele University, graduating with a degree in Politics and International Relations in 2012, and further studied at University College London.He attended Keele University, graduating with a degree in Politics and International Relations in 2012, and further studied at University College London."
    },
    "Andrew Bridgen": {
        "unis": "University of Nottingham",
        "sentence": "He graduated from the University of Nottingham with a degree in biological sciences."
    },
    "Steve Brine": {
        "unis": "Liverpool Hope University",
        "sentence": "He studied history at Liverpool Hope University, where he also served a sabbatical year as president of its students' union."
    },
    "Paul Bristow": {
        "unis": "Lancaster University",
        "sentence": "He studied History and Politics at Lancaster University  (Cartmel College) and previously worked as a parliamentary aide for former Conservative MP Richard Spring."
    },
    "Sara Britcliffe": {
        "unis": "University of Manchester",
        "sentence": "She studied modern languages at the University of Manchester."
    },
    "Lyn Brown": {
        "unis": "University of Roehampton",
        "sentence": "She was educated at Drew Road Primary School, Silvertown and Plashet Comprehensive School before attending the Whitelands College, Putney (now part of Roehampton University)."
    },
    "Nick Brown": {
        "unis": "University of Manchester",
        "sentence": "He was educated at Tunbridge Wells Grammar School for Boys and the University of Manchester."
    },
    "Anthony Browne": {
        "unis": "Trinity Hall, Cambridge",
        "sentence": "He went to Fowlmere Primary School, fee-paying independent sector The Perse School and state sector Hills Road Sixth Form College in Cambridge, and then studied mathematics at Trinity Hall, Cambridge, receiving a BA (Hons) in 1988."
    },
    "Fiona Bruce": {
        "unis": "Victoria University of Manchester",
        "sentence": "Riley then studied law at the Victoria University of Manchester and further studies at Chester Law College."
    },
    "Felicity Buchan": {
        "unis": "Christ Church, Oxford",
        "sentence": "She attended the Fraserburgh Academy comprehensive school in Fraserburgh and subsequently studied law at Christ Church, Oxford."
    },
    "Karen Buck": {
        "unis": "London School of Economics",
        "sentence": "Born in Castlederg, County Tyrone, Northern Ireland, Buck was educated at the Chelmsford County High School for Girls and the London School of Economics, from where she was awarded a BSc and an MSc in Economics, and an MA in Social Policy and Administration."
    },
    "Robert Buckland": {
        "unis": "Inns of Court School of Law|Durham University",
        "sentence": "In 1990, he graduated in law from Hatfield College, University of Durham, where he'd been Secretary of the Junior Common Room and President of the Durham Union Society in Michaelmas term 1989; in 1991 called to the bar at the Inner Temple.The BBC at the time cited Cardiff University and Wales Governance Centre research which found Wales has \"the highest imprisonment rate in western Europe\".Buckland is married to Sian, whom he met at university."
    },
    "Alex Burghart": {
        "unis": "Christ Church, Oxford King's College London",
        "sentence": "After university, Burghart taught history at Warwick School before becoming a history tutor at King's College London."
    },
    "Richard Burgon": {
        "unis": "St John's College, Cambridge",
        "sentence": "Burgon read English Literature at St John's College, Cambridge, where he was chairman of the Cambridge University Labour Club.He was the first person in his immediate family to go to university, studying English Literature at St John's College, Cambridge."
    },
    "Conor Burns": {
        "unis": "University of Southampton",
        "sentence": "He was educated at the independent St Columba's College, St Albans, and read Modern History and Politics at the University of Southampton."
    },
    "Dawn Butler": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Rob Butler": {
        "unis": "University of Sheffield",
        "sentence": "He attended the University of Sheffield, where he studied French and Economics."
    },
    "Ian Byrne": {
        "unis": "Open University",
        "sentence": "He worked as a taxi driver while studying at The Open University and gaining a degree over six years."
    },
    "Liam Byrne": {
        "unis": "University of Manchester Harvard University",
        "sentence": "He studying History and Politics at the  University of Manchester, graduating with a first, and whilst at university was elected Communications Officer of the University of Manchester Students' Union.Byrne was then a Fulbright Scholar at Harvard Business School, taking an MBA with honours from Harvard University."
    },
    "Ruth Cadbury": {
        "unis": "University of Salford",
        "sentence": "She was privately educated at The Mount School, York, Bournville College, and the University of Salford, where she graduated BSc in social sciences in 1981."
    },
    "Alan Campbell": {
        "unis": "Lancaster University|University of Leeds|Northumbria University",
        "sentence": "Alan Campbell was born in Consett and went to Blackfyne Grammar School in the town before attending Lancaster University where he was awarded a BA in politics.He then gained a PGCE at the University of Leeds, before finishing his education at Newcastle Polytechnic with an MA in history."
    },
    "Dan Carden": {
        "unis": "London School of Economics",
        "sentence": "He went on to study BSc International Relations at the London School of Economics, where he was also Chair of the University Labour Club."
    },
    "Andy Carter": {
        "unis": "University of Leicester|University of Pennsylvania",
        "sentence": "He went on to study Economics at the University of Leicester.In 2011 he attended Wharton School of the University of Pennsylvania in the United States."
    },
    "James Cartlidge": {
        "unis": "University of Manchester",
        "sentence": "He was educated at Queen Elizabeth's School, which was a comprehensive when he attended but for most of its history has been a state grammar school for boys in the market town of Chipping Barnet in north west London, followed by the University of Manchester, where he studied Economics."
    },
    "Bill Cash": {
        "unis": "Lincoln College, Oxford",
        "sentence": "Cash grew up in Sheffield and was educated at Stonyhurst College in Lancashire before attending Lincoln College, Oxford, where he took an BA in History."
    },
    "Miriam Cates": {
        "unis": "University of Cambridge",
        "sentence": "Cates went on to study Natural Sciences at the University of Cambridge, where she earned a degree in genetics."
    },
    "Maria Caulfield": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Alex Chalk": {
        "unis": "Magdalen College, Oxford|City University London",
        "sentence": "He then studied modern history at Magdalen College, Oxford.Following graduation, Chalk obtained a Graduate Diploma in Law with distinction from the City University London, and qualified as a barrister from the Inns of Court School of Law."
    },
    "Sarah Champion": {
        "unis": "University of Sheffield",
        "sentence": "Sarah Champion was born in Maldon, Essex, and attended Prince William School in Oundle, then graduated with a BA degree in psychology from the University of Sheffield in 1991.After working as a volunteer at Sheffield's St Luke's Hospice and running art workshops at the city's Abbeydale Road Secondary School she gained full-time employment, running Rotherham Arts Centre from 1992 to 1994."
    },
    "Bambos Charalambous": {
        "unis": "Liverpool John Moores University",
        "sentence": "He was educated at Chace Boys' Comprehensive School, followed by Tottenham College and then Liverpool Polytechnic (now Liverpool John Moores University)."
    },
    "Rehman Chishti": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Christopher Chope": {
        "unis": "University of St Andrews",
        "sentence": "He was educated at the St Andrew's Preparatory School in Eastbourne and Marlborough College, before attending Queen's College at the University of St Andrews (now the University of Dundee) where he was awarded an LLB degree in 1970."
    },
    "Jo Churchill": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Feryal Clark": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Greg Clark": {
        "unis": "Magdalene College, Cambridge|London School of Economics",
        "sentence": "Clark was born in Middlesbrough and studied Economics at Magdalene College, Cambridge, where he was president of Cambridge University Social Democrats.Clark read Economics at Magdalene College, Cambridge.He then gained his PhD from the London School of Economics.He then studied at the London School of Economics, where he was awarded his PhD in 1992 with a thesis entitled, The effectiveness of incentive payment systems: an empirical test of individualism as a boundary condition."
    },
    "Simon Clarke": {
        "unis": "University College, Oxford",
        "sentence": "He was privately educated at Red House School in Norton, before going on to study History at University College, Oxford."
    },
    "Theo Clarke": {
        "unis": "Newcastle University Courtauld Institute of Art",
        "sentence": "She studied art history at Newcastle University and the Courtauld Institute of Art, specialising in Russian Art."
    },
    "Brendan Clarke-Smith": {
        "unis": "Nottingham Trent University",
        "sentence": "He went to secondary school in East Leake, and was the first member of his family to go to university, studying politics at Nottingham Trent University and later gaining a PGCE in religious education."
    },
    "Chris Clarkson": {
        "unis": "University of Dundee",
        "sentence": "He grew up in Blackburn, Lancashire where he attended St Wilfrid's Church of England High School, before studying law at Dundee University."
    },
    "James Cleverly": {
        "unis": "Ealing College of Higher Education",
        "sentence": "He pursued hospitality management studies at Ealing College of Higher Education (now University of West London) graduating with a Bachelor of Arts degree in 1991.After graduation, Cleverly worked for publishing company Verenigde Nederlandse Uitgeverijen, and joined Informa as international sales manager in 2002."
    },
    "Geoffrey Clifton-Brown": {
        "unis": "Royal Agricultural College",
        "sentence": "He was educated at Tormore School, in Deal, Kent and then Eton College, before attending the Royal Agricultural College where he qualified as a chartered surveyor in 1975."
    },
    "Thérèse Coffey": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Elliot Colburn": {
        "unis": "Aberystwyth University",
        "sentence": "Colburn has campaigned for the Conservative Party since the age of 13, and studied politics at Aberystwyth University."
    },
    "Damian Collins": {
        "unis": "St Benet's Hall, Oxford",
        "sentence": "He then studied Modern History at St Benet's Hall at the University of Oxford, graduating in 1996.During his time as a student, Collins was captain of the St Benet's Hall team on two episodes of University Challenge in October 1994 and January 1995, during Jeremy Paxman’s first series of the show.In 1995 Collins was President of the Oxford University Conservative Association.After graduating from the University of Oxford, Collins joined the Conservative Research Department (CRD) in 1996."
    },
    "Daisy Cooper": {
        "unis": "University of Leeds",
        "sentence": "She gained a Bachelor of Laws honours degree from Leeds University and a Master of Laws degree in public international law from Nottingham University, as well as a foundation certificate in psychotherapy and counselling."
    },
    "Yvette Cooper": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jeremy Corbyn": {
        "unis": "North London Polytechnic",
        "sentence": "He began a course in Trade Union Studies at North London Polytechnic but left after a year without a degree after a series of arguments with his tutors over the curriculum."
    },
    "Alberto Costa": {
        "unis": "University of Glasgow",
        "sentence": "He grew up in Bishopbriggs attending Turnbull High School and the University of Glasgow, where he served as President of the Glasgow University Students' Representative Council in 1995/6."
    },
    "Robert Courts": {
        "unis": "University of Sheffield",
        "sentence": "Courts was educated at Berkhamsted School, where he was head of Fry's House, before reading law at the University of Sheffield."
    },
    "Claire Coutinho": {
        "unis": "Exeter College, Oxford",
        "sentence": "Coutinho attended James Allen's Girls' School, a private day school in Dulwich, before studying mathematics and philosophy at Exeter College, Oxford."
    },
    "Geoffrey Cox": {
        "unis": "Downing College, Cambridge",
        "sentence": "Cox studied law and classics at Downing College, Cambridge."
    },
    "Neil Coyle": {
        "unis": "University of Hull",
        "sentence": "He received a BA in British Politics and Legislative Studies from the University of Hull."
    },
    "Stella Creasy": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Tracey Crouch": {
        "unis": "University of Hull",
        "sentence": "Born in Ashford, Kent, Crouch was educated at Folkestone School for Girls and graduated from the University of Hull with a law and politics degree in 1996.Crouch was a parliamentary researcher from 1996 to 1998 before working in PR for Harcourt Public Affairs from 1999 to 2000."
    },
    "Jon Cruddas": {
        "unis": "University of Warwick",
        "sentence": "A graduate of the University of Warwick, Cruddas was first elected to Parliament at the 2001 general election.Cruddas was educated at the Oaklands Roman Catholic Comprehensive School, Waterlooville, Portsmouth, before attending the University of Warwick where he ultimately received an M.A. and a Ph.D. in Industrial and Business Studies in 1991, writing a thesis entitled An analysis of value theory, the sphere of production and contemporary approaches to the reorganisation of workplace relations."
    },
    "John Cryer": {
        "unis": "University of Hertfordshire|University of the Arts London",
        "sentence": "No Data"
    },
    "Judith Cummins": {
        "unis": "Ruskin College University of Leeds",
        "sentence": "Cummins was born on 26 June 1967 and was educated at Ruskin College and the University of Leeds, attending college as a mature student on a Trade Union scholarship."
    },
    "Alex Cunningham": {
        "unis": "Darlington Technical College",
        "sentence": "Cunningham later attended Darlington Technical College, where he was awarded a certificate in journalism in 1976.Beginning his career as journalist, he joined the Darlington & Stockton Times in 1974, moved to the Hartlepool Mail in 1976 and joined Radio Tees a year later."
    },
    "Janet Daby": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ashley Dalton": {
        "unis": "Middlesex University",
        "sentence": "She attended All Hallows Catholic High School in Penwortham (1983–1988) and Preston College (1989–1991), and obtained a BA in English and politics (1996) and a DipHE in professional development (voluntary sector) (1997) from Middlesex University."
    },
    "James Daly": {
        "unis": "Edge Hill University|University of Leeds",
        "sentence": "Daly studied at Edge Hill College and then the University of Leeds."
    },
    "Ed Davey": {
        "unis": "Jesus College, Oxford Birkbeck, University of London",
        "sentence": "He then went on to study at Jesus College, Oxford, and Birkbeck, University of London."
    },
    "Gareth Davies": {
        "unis": "University of Nottingham|Harvard University",
        "sentence": "He attended a state comprehensive school before completing his undergraduate studies at the University of Nottingham, where he studied Politics and graduated with a 2:1 in 2006.He completed a Master's of Public Administration at the John F. Kennedy School of Government at Harvard University in 2016, during which time he visited North Korea on a study visit."
    },
    "Mims Davies": {
        "unis": "Swansea University",
        "sentence": "She then studied Politics and International Relations at Swansea University, being the first in her family to enter higher education."
    },
    "Philip Davies": {
        "unis": "University of Huddersfield",
        "sentence": "He was educated at Old Swinford Hospital School in Stourbridge, before studying at Huddersfield Polytechnic (which became Huddersfield University in his third year), where he was awarded a 2:1 BA Hons degree in history and political studies in 1993."
    },
    "David Davis": {
        "unis": "University of Warwick|London Business School",
        "sentence": "After doing so he won a place at the University of Warwick, where he graduated with a BSc Joint Hons in Molecular Science and Computer Science in 1971."
    },
    "Dehenna Davison": {
        "unis": "University of Hull",
        "sentence": "She studied British Politics and Legislative Studies at the University of Hull, where she was an NUS delegate, and successfully led a campaign to disaffiliate the university's student union in 2016.Davison studied British Politics and Legislative Studies at the University of Hull."
    },
    "Marsha de Cordova": {
        "unis": "London South Bank University",
        "sentence": "Cordova studied Law and European Policy Studies at London South Bank University."
    },
    "Thangam Debbonaire": {
        "unis": "University of Oxford|University of Bristol",
        "sentence": "She then took the first stage of a mathematics degree at the University of Oxford, leaving before graduating, while at the same time training as a cellist at the Royal College of Music.Subsequently, she gained an MSc in Management, Development and Social Responsibility at the University of Bristol.In August 2016, a student at the University of Bristol was investigated after telling Debbonaire to \"get in the sea\", a humorous Internet meme, which she misinterpreted as a literal death threat."
    },
    "Tan Dhesi": {
        "unis": "University College London|Keble College, Oxford|Fitzwilliam College, Cambridge",
        "sentence": "He is the son of Jaspal Singh Dhesi, who runs a construction company in the UK, and the former president of Guru Nanak Darbar Gurdwara, in Gravesend, Kent - the largest gurdwara in the UK.Dhesi received most of his primary education in the Punjab, India, before returning to the UK at the age of 9.Dhesi has a bachelor's degree in mathematics with Management Studies from University College London, studied Applied Statistics at Keble College, Oxford, and has a Master of Philosophy in the History and Politics of South Asia from Fitzwilliam College, Cambridge.He is the son of Jaspal Singh Dhesi, who runs a construction company in the UK, and the former president of Guru Nanak Darbar Gurdwara, in Gravesend, Kent - the largest gurdwara in the UK.Dhesi received most of his primary education in the Punjab, India, before returning to the UK at the age of 9.Dhesi has a bachelor's degree in mathematics with Management Studies from University College London, studied Applied Statistics at Keble College, Oxford, and has a Master of Philosophy in the History and Politics of South Asia from Fitzwilliam College, Cambridge.He is the son of Jaspal Singh Dhesi, who runs a construction company in the UK, and the former president of Guru Nanak Darbar Gurdwara, in Gravesend, Kent - the largest gurdwara in the UK.Dhesi received most of his primary education in the Punjab, India, before returning to the UK at the age of 9.Dhesi has a bachelor's degree in mathematics with Management Studies from University College London, studied Applied Statistics at Keble College, Oxford, and has a Master of Philosophy in the History and Politics of South Asia from Fitzwilliam College, Cambridge."
    },
    "Caroline Dinenage": {
        "unis": "Swansea University",
        "sentence": "She attended Wykeham House private school for girls, Oaklands RC Comprehensive School, Waterlooville, and then studied Politics and English at Swansea University."
    },
    "Sarah Dines": {
        "unis": "Brunel University London",
        "sentence": "She studied at Brunel University from 1983 to 1987, and at the Inns of Court School of Law between 1987 and 1988.While at university, she was chairman of the Brunel University Conservative Association, and Secretary of the London Conservative Students."
    },
    "Samantha Dixon": {
        "unis": "University of Sheffield",
        "sentence": "Dixon received a Batchelor of Arts in English literature from University of Sheffield in 1987."
    },
    "Jonathan Djanogly": {
        "unis": "Oxford Polytechnic",
        "sentence": "Djanogly was privately educated at University College School, an independent school for boys in Hampstead in North London, followed by Oxford Polytechnic in Oxford, where he was elected  chairman of the Conservative Association in 1987, and he earned a Bachelor of Arts in law and politics in 1987."
    },
    "Leo Docherty": {
        "unis": "SOAS, University of London|Royal Military Academy Sandhurst",
        "sentence": "He studied Swahili and Hindi at SOAS, University of London between 1996 and 2000, before attending the Royal Military Academy Sandhurst the following year.He studied Swahili and Hindi at SOAS, University of London between 1996 and 2000, before attending the Royal Military Academy Sandhurst the following year."
    },
    "Anneliese Dodds": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Michelle Donelan": {
        "unis": "University of York",
        "sentence": "Donelan was educated at The County High School, Leftwich, before graduating from the University of York with a Bachelor of Arts degree in history and politics."
    },
    "Alistair Strathern": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Steve Double": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Peter Dowd": {
        "unis": "Hugh Baird College|University of Liverpool|Lancaster University",
        "sentence": "No Data"
    },
    "Oliver Dowden": {
        "unis": "Trinity Hall, Cambridge",
        "sentence": "He said he had an \"excellent state education\", before going to Trinity Hall, Cambridge, where he read law."
    },
    "Jackie Doyle-Price": {
        "unis": "University College, Durham",
        "sentence": "Doyle-Price claimed that its left-wing councillors did \"everything they could to bully my parents into not buying their council house\", and one of her left-wing teachers encouraged her to build upon her new-found interest and participate in politics, suggesting that she \"go out and participate in democracy\".: 86  Following the council's alleged \"intimidation of her parents\", Doyle-Price joined the Conservatives to campaign for people to buy their council homes in 1986.Doyle-Price read economics and politics at Durham University.Her constituent college was University College.Shortly after graduating from university, Doyle-Price became a researcher before spending 18 months moving between temporary jobs and unemployment."
    },
    "Richard Drax": {
        "unis": "Royal Agricultural College|Royal Military Academy Sandhurst",
        "sentence": "He was educated at Harrow School before going to the Royal Agricultural College in Cirencester where he graduated with a diploma in rural land management in 1990, receiving a further diploma in journalism in 1995.Drax passed out from the Royal Military Academy Sandhurst and was commissioned in the British Army joining the Coldstream Guards on 9 December 1978 as a second lieutenant."
    },
    "Flick Drummond": {
        "unis": "University of Hull|University of Southampton",
        "sentence": "She was privately educated at Roedean School, before studying at both Hull University and Southampton University."
    },
    "James Duddridge": {
        "unis": "University of Essex",
        "sentence": "He read Government at the University of Essex."
    },
    "Rosie Duffield": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Iain Duncan Smith": {
        "unis": "Royal Military Academy Sandhurst",
        "sentence": "After education at the HMS Conway training school and Royal Military Academy Sandhurst, he served in the Scots Guards from 1975 to 1981, seeing tours in Northern Ireland and Rhodesia.He then attended the Royal Military Academy Sandhurst and was commissioned into the Scots Guards as a second lieutenant on 28 June 1975, with the service number 500263."
    },
    "Philip Dunne": {
        "unis": "Keble College, Oxford",
        "sentence": "He was educated at Abberley Hall School, followed by Eton College and Keble College, Oxford, where he was awarded a degree in Philosophy, Politics and Economics."
    },
    "Sarah Dyke": {
        "unis": "Harper Adams University",
        "sentence": "She was educated at Warminster School and studied Agricultural and Business Studies at Harper Adams University."
    },
    "Angela Eagle": {
        "unis": "St John's College, Oxford",
        "sentence": "She studied philosophy, politics, and economics at St John's College, Oxford, graduating from the university with a second-class Bachelor of Arts degree in 1983."
    },
    "Maria Eagle": {
        "unis": "Pembroke College, Oxford|University of Law",
        "sentence": "She studied Philosophy, politics and economics at Pembroke College, Oxford and Law at the College of Law, London.She was educated at St Peter's Church of England School in Formby, Merseyside and Formby High School before attending Pembroke College, Oxford, where she was awarded a Bachelor of Arts degree in Philosophy, politics and economics in 1983.Eagle worked in the voluntary sector from 1983 to 1990, and then went to the College of Law, London, where she took her law finals in 1990, before she joined Brian Thompson & Partners in Liverpool as an articled clerk in 1990."
    },
    "Mark Eastwood": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ruth Edwards": {
        "unis": "London School of Theology University of Bristol",
        "sentence": "She went on to complete a master's MSc degree in International Development and Security at the University of Bristol, achieving a Distinction."
    },
    "Clive Efford": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Julie Elliott": {
        "unis": "Newcastle Polytechnic",
        "sentence": "She was educated at Seaham Northlea Comprehensive, later gaining a degree in Government and Public Policy at Newcastle Polytechnic – now known as Northumbria University."
    },
    "Michael Ellis": {
        "unis": "University of Buckingham|City Law School",
        "sentence": "He went on to study at the private University of Buckingham, where he obtained an upper-second class LL.B. degree in 1993, and won the Aylesbury Vale District Council Chairman's Prize for the Best Performance in Public Law that year."
    },
    "Tobias Ellwood": {
        "unis": "Loughborough University|City, University of London",
        "sentence": "He attended Loughborough University from 1985 to 1990, and became a sabbatical officer at Loughborough Students' Union."
    },
    "Natalie Elphicke": {
        "unis": "University of Kent",
        "sentence": "She attended Queenswood School in Hertfordshire, Clarendon House Grammar School in Ramsgate and Canterbury College, before studying law at the University of Kent in Canterbury, gaining an LLB (Hons) degree."
    },
    "Florence Eshalomi": {
        "unis": "Middlesex University",
        "sentence": "She is the first member of her family to go to university, graduating with a BA Hons in Political & International Studies with Law from Middlesex University."
    },
    "Bill Esterson": {
        "unis": "University of Leeds",
        "sentence": "He holds a joint degree in Mathematics and Philosophy from the University of Leeds."
    },
    "George Eustice": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Luke Evans": {
        "unis": "University of Birmingham",
        "sentence": "Evans began studying at the University of Birmingham Medical School in 2002, and qualified as a doctor in 2007.In 2009, Evans returned to the University of Birmingham to teach anatomy, and began training to become a GP."
    },
    "Nigel Evans": {
        "unis": "Swansea University",
        "sentence": "He was educated at Dynevor School, and then went to Swansea University, where he gained a BA in politics in 1979."
    },
    "David Evennett": {
        "unis": "London School of Economics",
        "sentence": "Sir David was educated at Buckhurst Hill County High School and the London School of Economics, where he was awarded an MSc in Economics."
    },
    "Ben Everitt": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Michael Fabricant": {
        "unis": "Loughborough University|University of Sussex",
        "sentence": "He studied economics at Loughborough University, receiving a Bachelor of Science degree.He went on to study at the University of Sussex, where he was awarded a master's degree in operations research in 1974, and undertook research at the University of Oxford, University of London, and the University of Southern California in economics and econometrics."
    },
    "Laura Farris": {
        "unis": "Lady Margaret Hall, Oxford",
        "sentence": "She studied philosophy, politics and economics at Lady Margaret Hall, Oxford, graduating in 2000 with an upper second class degree."
    },
    "Tim Farron": {
        "unis": "Newcastle University",
        "sentence": "Farron was born in Preston, Lancashire, and educated at Lostock Hall High School and Runshaw College, Leyland, before going on to Newcastle University, where he gained a BA in Politics in 1992.The following year, he was elected president of Newcastle University Students' Union, the first Liberal Democrat to hold the position, having joined the Liberal Party at the age of 16."
    },
    "Simon Fell": {
        "unis": "University of Warwick",
        "sentence": "He graduated with honours from the University of Warwick with a bachelor's degree in English literature."
    },
    "Anna Firth": {
        "unis": "Durham University",
        "sentence": "Firth studied law at Durham University."
    },
    "Colleen Fletcher": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Katherine Fletcher": {
        "unis": "University of Nottingham",
        "sentence": "She studied biology at University of Nottingham, during which time she worked as a nursing assistant in an elderly care home."
    },
    "Mark Fletcher": {
        "unis": "Jesus College, Cambridge",
        "sentence": "The first in his family to go to university, he studied land economy at Jesus College, Cambridge, and was president of the Cambridge University Students' Union."
    },
    "Nick Fletcher": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Richard Foord": {
        "unis": "Royal Military Academy Sandhurst Royal Holloway, University of London Cranfield University Open University",
        "sentence": "He has a BA in history from Royal Holloway, University of London, an MSc in global security from Cranfield University and an MBA from the Open University.Before the election he was International Collaboration and Export Control Manager at the University of Oxford having previously worked at the University of Exeter since 2010, most recently as acting head of global partnerships."
    },
    "Vicky Ford": {
        "unis": "Trinity College, Cambridge",
        "sentence": "Ford was educated at independent St Paul's Girls' School, independent Marlborough College and then studied Maths and Economics at Trinity College, Cambridge."
    },
    "Kevin Foster": {
        "unis": "University of Warwick",
        "sentence": "Foster studied law at the University of Warwick (LLB, 2000; LLM, 2001).They met in Coventry when he was a University of Warwick student."
    },
    "Yvonne Fovargue": {
        "unis": "University of Leeds",
        "sentence": "Fovargue attended Sale Grammar School and obtained a Bachelor of Arts in English from the University of Leeds."
    },
    "Liam Fox": {
        "unis": "University of Glasgow",
        "sentence": "Fox studied medicine at the University of Glasgow and worked as a GP and civilian army medical GP before being elected as an MP.He studied medicine at the University of Glasgow, graduating with a MB ChB in 1983."
    },
    "Vicky Foxcroft": {
        "unis": "De Montfort University",
        "sentence": "Foxcroft studied for a Bachelor of Arts degree in Drama and Business Studies at De Montfort University between 1996 and 2000.Foxcroft has been a Labour Party member since at least 1997, and has sat on the Party's National Policy Forum."
    },
    "Mary Foy": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Mark Francois": {
        "unis": "University of Bristol|King's College London",
        "sentence": "He studied history at the University of Bristol and graduated in 1986.He went on to complete a master's degree in War Studies at King's College London in 1987.In 1983, whilst at university, he joined the Territorial Army (TA), the part-time reserve force of the British Army."
    },
    "Lucy Frazer": {
        "unis": "Newnham College, Cambridge",
        "sentence": "Frazer was privately educated at Gateways School for Girls and Leeds Girls' High School, before studying Law at Newnham College, Cambridge, where she was elected President of the Cambridge Union."
    },
    "George Freeman": {
        "unis": "Girton College, Cambridge",
        "sentence": "He was privately educated at Radley College before going up to Girton College, Cambridge, and graduated with a Geography degree in 1989."
    },
    "Mike Freer": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Louie French": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Richard Fuller": {
        "unis": "University College, Oxford; Harvard Business School",
        "sentence": "Fuller was educated at Hazeldene School and Bedford Modern School (then a direct grant school), followed by University College, Oxford (1981–84), where he studied Politics, Philosophy & Economics, and Harvard Business School (1987–89) for his MBA.Fuller was President of the Oxford University Conservative Association (OUCA) in 1983.Following the failed nomination of Conservative candidates for the Oxford University Student Union (OUSU), Oxford's student paper Cherwell ran the headline \"OUCA falls apart\" and Fuller lost a vote of confidence but remained in office.Fuller joined the management consultancy company, LEK Consulting in 1984 as part of their first intake of university graduates."
    },
    "Gill Furniss": {
        "unis": "Leeds Beckett University",
        "sentence": "She was educated at the Chaucer School, Sheffield, and graduated from Leeds Metropolitan University with a BA in Library and Information Studies as a mature student in 1998."
    },
    "Marcus Fysh": {
        "unis": "Corpus Christi College, Oxford",
        "sentence": "He went on to study English literature at Corpus Christi College, Oxford."
    },
    "Roger Gale": {
        "unis": "Guildhall School of Music and Drama",
        "sentence": "He completed his education at the Guildhall School of Music and Drama in 1963."
    },
    "Barry Gardiner": {
        "unis": "University of St Andrews|Harvard University|Corpus Christi College, Cambridge",
        "sentence": "After studying at the University of St Andrews, he worked in the Student Christian Movement and considered a career in the Episcopal Church.He received an undergraduate Master of Arts from the University of St Andrews before serving for two years as full-time Scottish Regional Secretary of the Student Christian Movement.He then studied philosophy at Harvard University and researched the subject at Corpus Christi College, Cambridge.In 1983, Gardiner was awarded a Kennedy Memorial Trust scholarship to study Philosophy at Harvard University under John Rawls, returning to conduct doctoral research at Corpus Christi College, Cambridge for three years from 1984.He then studied philosophy at Harvard University and researched the subject at Corpus Christi College, Cambridge.In 1983, Gardiner was awarded a Kennedy Memorial Trust scholarship to study Philosophy at Harvard University under John Rawls, returning to conduct doctoral research at Corpus Christi College, Cambridge for three years from 1984."
    },
    "Mark Garnier": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Nus Ghani": {
        "unis": "Birmingham City University|University of Leeds",
        "sentence": "She studied at Birmingham City University, graduating with a BA in government and politics, and later gained a master's degree at Leeds University in international relations."
    },
    "Nick Gibb": {
        "unis": "University of Durham",
        "sentence": "Gibb was born in Amersham, Buckinghamshire and was educated at the College of St Hild and St Bede at the University of Durham.He then attended the College of St Hild and St Bede at the University of Durham where he received a Bachelor of Arts degree in Law in 1981."
    },
    "Peter Gibson": {
        "unis": "Newcastle University",
        "sentence": "He studied law at the University of Newcastle, graduating with an LLB in 1997."
    },
    "Jo Gideon": {
        "unis": "University of Birmingham",
        "sentence": "==\nGideon studied at Stourbridge High School, and then earned a degree (BA Hons in German) from the University of Birmingham."
    },
    "Preet Gill": {
        "unis": "University of East London",
        "sentence": "Gill graduated from the University of East London with a first-class BSc in sociology with social work."
    },
    "John Glen": {
        "unis": "Mansfield College, Oxford|Fitzwilliam College, Cambridge|King's College London",
        "sentence": "He was privately educated at King Edward's School, Bath, where he was head boy, and Mansfield College, Oxford, where he read modern history and was elected president of Mansfield College JCR.Following the election, he took an MBA at Fitzwilliam College, Cambridge, and worked in the oil and gas industries in the UK and in the United States.In 2015 he completed an MA in international security and strategy, with distinction, at King's College London through the Royal College of Defence Studies.In December 2015 Glen completed an MA in international security and strategy, with distinction, at King's College London through the Royal College of Defence Studies."
    },
    "Mary Glindon": {
        "unis": "Newcastle Polytechnic",
        "sentence": "No Data"
    },
    "Robert Goodwill": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Michael Gove": {
        "unis": "Lady Margaret Hall, Oxford",
        "sentence": "He attended the independent Robert Gordon's College and studied English at Lady Margaret Hall, Oxford.From 1985 to 1988 he read English at Lady Margaret Hall, Oxford, during which time he joined the Conservative Party."
    },
    "Richard Graham": {
        "unis": "Christ Church, Oxford",
        "sentence": "The grandson of the cricketer and British Army officer Ogilvie Graham, Graham was educated at Eton and Christ Church, Oxford where he was an exhibitioner in Modern History."
    },
    "Helen Grant": {
        "unis": "University of Hull",
        "sentence": "She completed an LLB at the University of Hull and her solicitor qualification at the College of Law in Guildford."
    },
    "James Gray": {
        "unis": "University of Glasgow|Christ Church, Oxford",
        "sentence": "He studied history at the University of Glasgow, where he graduated with an undergraduate Master of Arts (MA) in 1975.He continued post-graduate studies at Christ Church, Oxford, where he completed a history thesis in 1977."
    },
    "Chris Grayling": {
        "unis": "Sidney Sussex College, Cambridge",
        "sentence": "He then went to Sidney Sussex College, Cambridge, where he graduated with an upper-second class Bachelor of Arts degree in history in 1984.Grayling joined BBC News in 1985 as a trainee, becoming a producer in 1986."
    },
    "Chris Green": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Damian Green": {
        "unis": "Balliol College, Oxford",
        "sentence": "Green was born in Barry, Vale of Glamorgan, in Wales and studied philosophy, politics and economics at Balliol College, Oxford.Green studied Philosophy, politics and economics at Balliol College, Oxford."
    },
    "Sarah Green": {
        "unis": "Aberystwyth University Manchester Metropolitan University",
        "sentence": "She studied at Aberystwyth University and Manchester Metropolitan University."
    },
    "Lilian Greenwood": {
        "unis": "St Catharine's College, Cambridge",
        "sentence": "No Data"
    },
    "Margaret Greenwood": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Griffith": {
        "unis": "University of Nottingham",
        "sentence": "He grew up in Bromley and attended St Mary & St Joseph's School, a state comprehensive school in Sidcup, before going up to read Law at Nottingham University from 1989 to 1992."
    },
    "James Grundy": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jonathan Gullis": {
        "unis": "Oxford Brookes University|Institute of Education",
        "sentence": "He studied International Relations with Law at Oxford Brookes University and obtained a PGCE in secondary citizenship at the Institute of Education (now part of UCL).Gullis worked in schools from 2012 to 2019, comparing his teaching experiences to boxing.He studied International Relations with Law at Oxford Brookes University and obtained a PGCE in secondary citizenship at the Institute of Education (now part of UCL).Gullis worked in schools from 2012 to 2019, comparing his teaching experiences to boxing."
    },
    "Andrew Gwynne": {
        "unis": "Tameside College|Wrexham Glyndŵr University|University of Salford",
        "sentence": "Born and brought up in Manchester, Gwynne was educated at Egerton Park Community High School (now called Denton Community College) in Denton, Tameside College of Technology in Ashton-under-Lyne, North East Wales Institute of Higher Education in Wrexham from 1992 to 1995 and the University of Salford from 1995 to 1998, earning a BA in Politics and Contemporary History.Born and brought up in Manchester, Gwynne was educated at Egerton Park Community High School (now called Denton Community College) in Denton, Tameside College of Technology in Ashton-under-Lyne, North East Wales Institute of Higher Education in Wrexham from 1992 to 1995 and the University of Salford from 1995 to 1998, earning a BA in Politics and Contemporary History."
    },
    "Louise Haigh": {
        "unis": "University of Nottingham",
        "sentence": "She then studied government and economics at the London School of Economics but did not complete the course, and opted to study politics at the University of Nottingham."
    },
    "Robert Halfon": {
        "unis": "University of Exeter",
        "sentence": "Halfon was privately educated at Highgate School and then studied at the University of Exeter, graduating with a BA in Politics and an MA in Russian politics and Eastern European politics."
    },
    "Luke Hall": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Fabian Hamilton": {
        "unis": "University of York",
        "sentence": "He then attended the University of York where he was awarded a Bachelor of Arts degree."
    },
    "Paulette Hamilton": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stephen Hammond": {
        "unis": "Queen Mary University of London",
        "sentence": "==\nStephen Hammond was born in Southampton and educated at the private King Edward VI School in the city, before reading Economics at Queen Mary University of London."
    },
    "Matt Hancock": {
        "unis": "Exeter College, Oxford|Christ's College, Cambridge",
        "sentence": "He studied a BA in Philosophy, Politics and Economics (PPE) at Exeter College, Oxford, and an MPhil in Economics at Christ's College, Cambridge.Hancock then studied at Exeter College, Oxford, and graduated with a first in Philosophy, Politics and Economics, and later earned a MPhil degree in Economics at Christ's College, Cambridge.He studied a BA in Philosophy, Politics and Economics (PPE) at Exeter College, Oxford, and an MPhil in Economics at Christ's College, Cambridge.Hancock then studied at Exeter College, Oxford, and graduated with a first in Philosophy, Politics and Economics, and later earned a MPhil degree in Economics at Christ's College, Cambridge."
    },
    "Greg Hands": {
        "unis": "Robinson College, Cambridge",
        "sentence": "He went on to attend Robinson College, Cambridge, where he graduated with a first in Modern History in 1989."
    },
    "Emma Hardy": {
        "unis": "University of Liverpool|University of Leeds",
        "sentence": "She attended Wyke Sixth Form College to study her A-Levels before studying for an undergraduate degree in Politics at the University of Liverpool, graduating in 2001.She then completed a PGCE at the University of Leeds in 2004, and taught for over ten years at Willerby Carr Lane Primary School."
    },
    "Harriet Harman": {
        "unis": "Goodricke College, York",
        "sentence": "Born in London to a doctor and a barrister, Harman was privately educated at St Paul's Girls' School before going on to study politics at the University of York.Harman gained a 2:1 BA in Politics from the University of York."
    },
    "Mark Harper": {
        "unis": "Brasenose College, Oxford",
        "sentence": "Harper was born in Swindon and studied philosophy, politics and economics at Brasenose College, Oxford.He read philosophy, politics and economics at Brasenose College, Oxford where he studied under Professor Vernon Bogdanor."
    },
    "Rebecca Harris": {
        "unis": "Bedales School|London School of Economics",
        "sentence": "She earned her degree from the London School of Economics (BSc)."
    },
    "Trudy Harrison": {
        "unis": "University of Salford",
        "sentence": "During this time, she completed a Foundation Degree in Sustainable Communities at the University of Salford."
    },
    "Sally-Ann Hart": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Helen Hayes": {
        "unis": "Balliol College, Oxford",
        "sentence": "She was an undergraduate at Balliol College, Oxford."
    },
    "John Hayes": {
        "unis": "University of Nottingham",
        "sentence": "He was educated at the Colfe's Grammar School (Lewisham) and at the University of Nottingham from where he graduated with a BA degree in politics and a PGCE in history and English."
    },
    "Oliver Heald": {
        "unis": "Pembroke College, Cambridge|City Law School",
        "sentence": "Heald was born in Reading, Berkshire, and was educated at the Reading School and Pembroke College, Cambridge, where he read Law."
    },
    "John Healey": {
        "unis": "Christ's College, Cambridge",
        "sentence": "He studied Social and Political Science at Christ's College, Cambridge where he received a BA in 1982."
    },
    "James Heappey": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Chris Heaton-Harris": {
        "unis": "Wolverhampton Polytechnic",
        "sentence": "He attended Wolverhampton Polytechnic, which in 1992 became the University of Wolverhampton."
    },
    "Gordon Henderson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Mark Hendrick": {
        "unis": "Liverpool John Moores University, Victoria University of Manchester",
        "sentence": "He later attended Liverpool Polytechnic (now Liverpool John Moores University), where he completed a Bachelor of Science degree in Electrical and Electronic Engineering.He also earned a Master of Science degree in Computer Science from the University of Manchester."
    },
    "Darren Henry": {
        "unis": "University of Lincoln",
        "sentence": "No Data"
    },
    "Antony Higginbotham": {
        "unis": "University of Hull|City Law School",
        "sentence": "He then went on to complete a Graduate Diploma in Law at City Law School."
    },
    "Meg Hillier": {
        "unis": "St Hilda's College, Oxford",
        "sentence": "She then went to St Hilda's College at the University of Oxford, where she read Philosophy, Politics and Economics."
    },
    "Damian Hinds": {
        "unis": "Trinity College, Oxford",
        "sentence": "Hinds was educated at St Ambrose College and Trinity College, Oxford."
    },
    "Simon Hoare": {
        "unis": "Greyfriars, Oxford",
        "sentence": "Hoare was educated at the Bishop Hannon High School, Cardiff, a Roman Catholic comprehensive school, then Greyfriars, Oxford, where he gained a BA degree in Modern History."
    },
    "Wera Hobhouse": {
        "unis": "University of Münster Free University of Berlin",
        "sentence": "She studied history and fine art at the University of Münster and then studied art for two years at the École des Beaux Arts in Paris.She then moved back to Germany, completing a master's degree in history and fine art at the Free University of Berlin."
    },
    "Margaret Hodge": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Sharon Hodgson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Richard Holden": {
        "unis": "London School of Economics",
        "sentence": "He then went to St Mary's College in Blackburn, before studying at the London School of Economics, graduating with a BSc in Government and History in 2007."
    },
    "Kate Hollern": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Kevin Hollinrake": {
        "unis": "Sheffield City Polytechnic",
        "sentence": "He attended Easingwold School and studied physics at Sheffield City Polytechnic, (now Sheffield Hallam University) though he did not complete his degree.After dropping out of Sheffield City Polytechnic, Hollinrake worked for Prudential."
    },
    "Philip Hollobone": {
        "unis": "Lady Margaret Hall, Oxford",
        "sentence": "He went on to study at Lady Margaret Hall, Oxford where he was awarded a BA degree in Modern History and Economics."
    },
    "Adam Holloway": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Paul Holmes": {
        "unis": "University of Southampton",
        "sentence": "He then went on to study Politics and International Relations at the University of Southampton.While a second-year student at the University of Southampton, Holmes was elected as a Conservative councillor in the 2008 Southampton City Council election, representing the Redbridge ward, a seat he gained from the Labour Party."
    },
    "Rachel Hopkins": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "George Howarth": {
        "unis": "University of Salford",
        "sentence": "He went on to study at the University of Salford."
    },
    "John Howell": {
        "unis": "University of Edinburgh St John's College, Oxford",
        "sentence": "He studied at the University of Edinburgh and holds a doctorate in archaeology from St John's College, Oxford."
    },
    "Paul Howell": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Lindsay Hoyle": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Nigel Huddleston": {
        "unis": "Christ Church, Oxford|University of California, Los Angeles",
        "sentence": "He was educated at the Sir Robert Pattinson Academy, a state secondary school in North Hykeham in Lincolnshire, followed by Christ Church, Oxford, where he studied politics and economics."
    },
    "Neil Hudson": {
        "unis": "University of Cambridge|University of Edinburgh",
        "sentence": "Hudson completed an internship at the University of Sydney, gaining a diploma in 1995, and later a PhD in Grass Sickness and Equine Gastroenterology at the University of Edinburgh."
    },
    "Eddie Hughes": {
        "unis": "University of Glamorgan",
        "sentence": "Hughes studied civil engineering at the University of Glamorgan."
    },
    "Jane Hunt": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jeremy Hunt": {
        "unis": "Magdalen College, Oxford",
        "sentence": "The son of a senior officer in the Royal Navy, Hunt was born in Kennington and studied philosophy, politics and economics at Magdalen College, Oxford, where he was President of the Oxford University Conservative Association.He then studied philosophy, politics and economics at Magdalen College, Oxford, graduating with a first class honours Bachelor of Arts (BA) degree."
    },
    "Tom Hunt": {
        "unis": "University of Manchester|Pembroke College, Oxford",
        "sentence": "He went on to study Politics and Modern History at the University of Manchester and an MSc at Pembroke College, Oxford.He went on to study Politics and Modern History at the University of Manchester and an MSc at Pembroke College, Oxford."
    },
    "Rupa Huq": {
        "unis": "Newnham College, Cambridge|University of East London|Marc Bloch University",
        "sentence": "In 1993, she graduated with an upper second in Political and Social Sciences and Law from Newnham College, Cambridge, for a BA.In 1999, she completed a PhD in cultural studies with a thesis on youth culture at the University of East London, comparing young people in East London and the Alsace region of France."
    },
    "Imran Hussain": {
        "unis": "University of Huddersfield",
        "sentence": "No Data"
    },
    "Dan Jarvis": {
        "unis": "Aberystwyth University Royal Military Academy Sandhurst|King's College London",
        "sentence": "He studied international politics at what was then the University of Wales, Aberystwyth.Although his military service had precluded political activity, Jarvis had joined the Labour Party at the age of 18 while at university."
    },
    "Sajid Javid": {
        "unis": "University of Exeter",
        "sentence": "He studied Economics and Politics at the University of Exeter, where he joined the Conservative Party.After being told by his school that he could only study two A Levels when he believed he needed three to go to university, Javid subsequently attended Filton Technical College from 1986 to 1988, and finally the University of Exeter from 1988 to 1991, completing a BA in economics and politics."
    },
    "Ranil Jayawardena": {
        "unis": "London School of Economics",
        "sentence": "Jayawardena graduated from the London School of Economics and worked for Lloyds Banking Group, where he became a senior manager.At the London School of Economics, he graduated with a BSc in government in 2008."
    },
    "Bernard Jenkin": {
        "unis": "Corpus Christi College, Cambridge",
        "sentence": "He was educated at the fee-paying independent Highgate School, the voluntary aided William Ellis School, and Corpus Christi College, Cambridge, where he was awarded a choral exhibition and gained a BA honours degree in English literature in 1982."
    },
    "Mark Jenkinson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrea Jenkyns": {
        "unis": "University of Lincoln|Open University",
        "sentence": "In her late thirties, Jenkyns studied for a degree in Economics from the Open University and for one in International Relations from the University of Lincoln.In her late thirties, Jenkyns studied for a degree in Economics from the Open University and for one in International Relations from the University of Lincoln."
    },
    "Robert Jenrick": {
        "unis": "St John's College, Cambridge University of Pennsylvania",
        "sentence": "Born in Wolverhampton, Jenrick attended St John's College, Cambridge, where he read history, followed by the University of Pennsylvania, where he studied political science.He obtained a Thouron Award to study Political Science at the University of Pennsylvania from 2003 to 2004."
    },
    "Caroline Johnson": {
        "unis": "Newcastle University",
        "sentence": "She graduated from Newcastle University Medical School in 2001."
    },
    "Diana Johnson": {
        "unis": "Queen Mary University of London",
        "sentence": "She gained an LLB in Law from Queen Mary University of London."
    },
    "Gareth Johnson": {
        "unis": "The College of Law",
        "sentence": "No Data"
    },
    "Kim Johnson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "David Johnston": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Jones": {
        "unis": "University of Leeds",
        "sentence": "Born in Ilkley, West Riding of Yorkshire, Jones was privately educated at Bradford Grammar School and the University of Leeds."
    },
    "Darren Jones": {
        "unis": "University of Plymouth|University of the Westof England|University of Law",
        "sentence": "He attended Portway Community School in Shirehampton, a state comprehensive, before studying human bioscience at the University of Plymouth, where he was subsequently elected President of the Students' Union.Jones worked in the National Health Service and served on the boards of the University of Plymouth and the Plymouth NHS Trust, and had a weekly newspaper column in the Plymouth Herald.He later read law at the University of the West of England and the University of Law in Bristol before being admitted as a solicitor."
    },
    "Kevan Jones": {
        "unis": "University of Southern Maine, Newcastle Polytechnic",
        "sentence": "He attended Portland Comprehensive School in Worksop and Newcastle Polytechnic, before studying at the University of Southern Maine, gaining a BA (Hons) in Government and Public Policy."
    },
    "Marcus Jones": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Sarah Jones": {
        "unis": "Durham University",
        "sentence": "She was educated at the private Old Palace School in Croydon and at Durham University, where she read History."
    },
    "Simon Jupp": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Mike Kane": {
        "unis": "Manchester Metropolitan University",
        "sentence": "He graduated from Manchester Metropolitan University with a BA in Social Sciences in 1997 and a PGCE in 1999.Kane was a primary school teacher at Springfield Primary School, Sale."
    },
    "Daniel Kawczynski": {
        "unis": "University of Stirling",
        "sentence": "He was educated at St George's College, Weybridge, an independent Roman Catholic school in Surrey, followed by Birmingham Polytechnic and then the University of Stirling where he studied Business Studies and French, graduating in 1994."
    },
    "Alicia Kearns": {
        "unis": "Fitzwilliam College, Cambridge",
        "sentence": "She studied social and political sciences at Fitzwilliam College, Cambridge, graduating in 2009."
    },
    "Gillian Keegan": {
        "unis": "Liverpool John Moores University London Business School",
        "sentence": "She then studied Business Studies at Liverpool John Moores University, graduating with a bachelor's degree.Keegan also graduated with a Master of Science in Strategy and Leadership (Sloan Fellowship) from the London Business School in 2011.After university, Keegan had a business career working at Delco Electronics (part of the General Motors Group), NatWest Bank (senior buyer), MasterCard International (commercial director), Amadeus IT Group (group vice president of Multinational Customer Group based in Madrid) and Travelport (chief marketing officer) for over 27 years."
    },
    "Barbara Keeley": {
        "unis": "University of Salford",
        "sentence": "Keeley was educated at Mount St Mary's College in Leeds and the University of Salford, gaining a BA in Politics and Contemporary History."
    },
    "Liz Kendall": {
        "unis": "Queens' College, Cambridge",
        "sentence": "Kendall was born in Abbots Langley, near Watford, Hertfordshire and studied at the University of Cambridge, reading history at Queens' College.After leaving school, she attended Cambridge University, graduating with first class honours.She has spoken in support of expanding the academies programme and keeping the free schools initiative saying that focus should be on the quality of education rather than structures and that investment in the early years should be a priority over cutting university tuition fees."
    },
    "Afzal Khan": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Greg Knight": {
        "unis": "The College of Law",
        "sentence": "No Data"
    },
    "Julian Knight": {
        "unis": "University of Hull",
        "sentence": "He graduated with a degree in history from the University of Hull."
    },
    "Danny Kruger": {
        "unis": "University of Edinburgh|University of Oxford",
        "sentence": "The son of writer and property developer Rayne Kruger and restaurateur and television presenter Prue Leith, Kruger was educated at Eton College, subsequently studying history at the University of Edinburgh and University of Oxford.Kruger studied history at the University of Edinburgh.The son of writer and property developer Rayne Kruger and restaurateur and television presenter Prue Leith, Kruger was educated at Eton College, subsequently studying history at the University of Edinburgh and University of Oxford.He obtained a doctorate in history from the University of Oxford in 2000.After university, he became the director of research at the centre-right think tank Centre for Policy Studies in 2001."
    },
    "Kwasi Kwarteng": {
        "unis": "Trinity College, Cambridge",
        "sentence": "Kwarteng was born in London to Ghanaian immigrant parents and was educated at Eton College and Trinity College, Cambridge.He then studied classics and history at Trinity College, Cambridge, matriculating in 1993."
    },
    "Peter Kyle": {
        "unis": "University of Sussex",
        "sentence": "By the age of 25, he was accepted on his third attempt to become a student at the University of Sussex, where he gained a degree in geography, international development and environmental studies, and later a doctorate in community development."
    },
    "Eleanor Laing": {
        "unis": "University of Edinburgh",
        "sentence": "Laing graduated from Edinburgh University with Master of Arts and Bachelor of Laws degrees.She was the first female President of the Edinburgh University Students' Association."
    },
    "David Lammy": {
        "unis": "SOAS University of London Harvard University",
        "sentence": "He studied at the School of Oriental and African Studies (SOAS), University of London, graduating with a 2:1 in law.Lammy went on to study at Harvard University, where he became the first black Briton to attend Harvard Law School; he studied for a Master of Laws degree and graduated in 1997.He has also criticised the University of Oxford for admitting relatively few black students and students from disadvantaged backgrounds."
    },
    "Robert Largan": {
        "unis": "University of Manchester",
        "sentence": "Largan attended his local comprehensive, Philips High School, then studied economics and politics at the University of Manchester between 2005 and 2008.His first job was working behind the fish counter at the supermarket Asda while studying at university."
    },
    "Pauline Latham": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ian Lavery": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Kim Leadbeater": {
        "unis": "Leeds Beckett University|University of Huddersfield",
        "sentence": "Leadbeater went on to graduate with a Bachelor of Science (BSc) degree in health-related exercise and fitness from Leeds Beckett University in 2005 and a Postgraduate Certificate in Education (PGCE) from the University of Huddersfield in 2008.Leadbeater went on to graduate with a Bachelor of Science (BSc) degree in health-related exercise and fitness from Leeds Beckett University in 2005 and a Postgraduate Certificate in Education (PGCE) from the University of Huddersfield in 2008."
    },
    "Andrea Leadsom": {
        "unis": "University of Warwick",
        "sentence": "After graduating with a degree in political science at the University of Warwick, she began a career in finance including working as Institutional Banking Director at Barclays, and later as Senior Investment Officer and Head of Corporate Governance at Invesco Perpetual.She attended Tonbridge Girls' Grammar School, before studying Political Science at the University of Warwick."
    },
    "Edward Leigh": {
        "unis": "University College, Durham",
        "sentence": "Leigh was privately educated at The Oratory School and the Lycée Français Charles de Gaulle, before going to University College, Durham, where he read History (BA) and was elected President of the Durham Union Society."
    },
    "Ian Levy": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Emma Lewell-Buck": {
        "unis": "Northumbria University Durham University",
        "sentence": "She studied politics and media studies at Northumbria University, before gaining a master's degree in social work from Durham University."
    },
    "Andrew Lewer": {
        "unis": "Newcastle University",
        "sentence": "He attended Queen Elizabeth's Grammar School in Ashbourne, Derbyshire, before studying history at Newcastle University."
    },
    "Brandon Lewis": {
        "unis": "University of Buckingham|King's College London|Inns of Court School of Law|Inner Temple",
        "sentence": "He studied economics at the University of Buckingham, switching to King's College London for his master's degree.He received a BSc degree in Economics from the University of Buckingham, an LLB honours degree in Law from the same institution, and an LLM in commercial law from King's College London.He studied economics at the University of Buckingham, switching to King's College London for his master's degree.He received a BSc degree in Economics from the University of Buckingham, an LLB honours degree in Law from the same institution, and an LLM in commercial law from King's College London.He was called to the bar by the Inner Temple."
    },
    "Clive Lewis": {
        "unis": "University of Bradford|Royal Military Academy Sandhurst",
        "sentence": "He was the first member of his family to attend university, studying economics at the University of Bradford before being elected student union president, and later vice-president of the National Union of Students (NUS).Lewis joined the Territorial Army, passing out of the Royal Military Academy Sandhurst in 2006 as an infantry officer with The Rifles."
    },
    "Julian Lewis": {
        "unis": "Balliol College, Oxford St Antony's College, Oxford",
        "sentence": "In December 2010, he attacked, and was one of six Conservative MPs who voted against Coalition proposals to increase student tuition fees from a maximum of £3,000 to a maximum of £9,000 per year, on the grounds that this would deter the less well-off from going to university.A second edition of his 1988 book Changing Direction: British Military Planning for Post-war Strategic Defence, 1942–1947 was published in 2003 and a university paperback edition in 2008.In 2010, Lewis was appointed as a Visiting Senior Research Fellow, Centre for Defence Studies, Department of War Studies, King's College, London; and, in 2019, he became an Honorary Professor, Strategy and Security Institute, University of Exeter."
    },
    "Ian Liddell-Grainger": {
        "unis": "West of Scotland Agricultural College",
        "sentence": "No Data"
    },
    "Simon Lightwood": {
        "unis": "Bretton Hall College",
        "sentence": "Lightwood has a degree in theatre acting from Bretton Hall College and bought his first house in Wakefield."
    },
    "George Galloway": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Chris Loder": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Mark Logan": {
        "unis": "Ballymena Academy|Queen's University Belfast|London School of Economics|Wadham College, University of Oxford",
        "sentence": "He graduated from Queen's University Belfast, and then earned two master's degrees, one from the London School of Economics and the second from Wadham College, University of Oxford.He graduated from Queen's University Belfast, and then earned two master's degrees, one from the London School of Economics and the second from Wadham College, University of Oxford.He graduated from Queen's University Belfast, and then earned two master's degrees, one from the London School of Economics and the second from Wadham College, University of Oxford."
    },
    "Rebecca Long-Bailey": {
        "unis": "Manchester Metropolitan University",
        "sentence": "Born in Old Trafford, Greater Manchester, Long-Bailey studied Politics and Sociology at Manchester Metropolitan University.Long-Bailey studied Politics and Sociology at Manchester Metropolitan University, and then completed \"various part-time law conversion and solicitors' courses\"."
    },
    "Marco Longhi": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Julia Lopez": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jack Lopresti": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jonathan Lord": {
        "unis": "Merton College, Oxford",
        "sentence": "Lord then graduated in 1985 with a BA in History from Merton College, Oxford, and was president of the Oxford University Conservative Association in Michaelmas Term 1983."
    },
    "Tim Loughton": {
        "unis": "University of Warwick Clare College, Cambridge",
        "sentence": "From 1980 to 1983, he studied classical civilisation at the University of Warwick.He was the secretary of the University of Warwick Conservative Association."
    },
    "Caroline Lucas": {
        "unis": "University of Exeter|University of Kansas",
        "sentence": "Born in Malvern in Worcestershire, Lucas graduated from the University of Exeter and the University of Kansas before receiving a PhD from the University of Exeter in 1989.She then went to the University of Exeter, where she gained a first-class BA (Hons) in English Literature in 1983.Lucas won a scholarship to attend the University of Kansas between 1983 and 1984, gaining a Diploma of Journalism, before studying for a PhD degree in English from the University of Exeter, awarded in 1990, with a thesis entitled Writing for Women: a study of woman as reader in Elizabethan romance.Born in Malvern in Worcestershire, Lucas graduated from the University of Exeter and the University of Kansas before receiving a PhD from the University of Exeter in 1989.Lucas won a scholarship to attend the University of Kansas between 1983 and 1984, gaining a Diploma of Journalism, before studying for a PhD degree in English from the University of Exeter, awarded in 1990, with a thesis entitled Writing for Women: a study of woman as reader in Elizabethan romance."
    },
    "Holly Lynch": {
        "unis": "Lancaster University",
        "sentence": "She attended Brighouse High School and studied Politics and History at Lancaster University.Lynch married Chris Walker in December 2014.Lynch is a former rugby union player for both Lancaster University and Halifax Vandals and has talked of her desire to encourage others to take up the sport."
    },
    "Craig Mackinlay": {
        "unis": "University of Birmingham",
        "sentence": "After attending Rainham Mark Grammar School, he went up to the University of Birmingham, where he read zoology and comparative physiology."
    },
    "Cherilyn Mackrory": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Rachel Maclean": {
        "unis": "St Hugh's College, Oxford,Aston University",
        "sentence": "She studied Experimental Psychology at St Hugh's College, Oxford and obtained a master's degree in Work and Occupational Psychology at Aston University."
    },
    "Justin Madders": {
        "unis": "University of Sheffield",
        "sentence": "Madders studied law at the University of Sheffield and worked as a solicitor, specialising in employment law, before entering politics."
    },
    "Khalid Mahmood": {
        "unis": "UCE Birmingham",
        "sentence": "He studied at UCE Birmingham."
    },
    "Shabana Mahmood": {
        "unis": "Lincoln College, University of Oxford",
        "sentence": "In 2018, Mahmood was named as one of the Brummies Who Inspire in celebration of the 175th anniversary of Birmingham City University."
    },
    "Alan Mak": {
        "unis": "Peterhouse, Cambridge",
        "sentence": "He read Law at Peterhouse, Cambridge, winning the ECS Wade Prize for Administrative Law, before completing a post-graduate law & business diploma in Oxford, where he was a runner-up for the Oxford Leadership Prize."
    },
    "Seema Malhotra": {
        "unis": "University of Warwick|Aston University",
        "sentence": "One of five children of Sushil Kumar Malhotra (1941–2014), of Osterley, a shop owner, formerly a financial adviser and an engineer, and his wife Usha, she was educated at schools in the London Borough of Hounslow, studied politics and philosophy at the University of Warwick and took a postgraduate degree in business and information studies at Aston University.One of five children of Sushil Kumar Malhotra (1941–2014), of Osterley, a shop owner, formerly a financial adviser and an engineer, and his wife Usha, she was educated at schools in the London Borough of Hounslow, studied politics and philosophy at the University of Warwick and took a postgraduate degree in business and information studies at Aston University."
    },
    "Kit Malthouse": {
        "unis": "Newcastle University",
        "sentence": "He studied politics and economics at Newcastle University."
    },
    "Anthony Mangnall": {
        "unis": "University of Exeter",
        "sentence": "After attending Shrewsbury School in Shropshire, he read history, politics, and sociology at the University of Exeter, graduating as BA."
    },
    "Scott Mann": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Julie Marson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Rachael Maskell": {
        "unis": "University of East Anglia",
        "sentence": "Maskell graduated from the University of East Anglia with a degree in physiotherapy in 1994."
    },
    "Keir Mather": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Theresa May": {
        "unis": "St Hugh's College, Oxford",
        "sentence": "May grew up in Oxfordshire and attended St Hugh's College, Oxford."
    },
    "Jerome Mayhew": {
        "unis": "University of Edinburgh|Cranfield University",
        "sentence": "He was privately educated at Tonbridge School, and then studied at University of Edinburgh (where he received an MA Hons) and Cranfield University.He was privately educated at Tonbridge School, and then studied at University of Edinburgh (where he received an MA Hons) and Cranfield University."
    },
    "Paul Maynard": {
        "unis": "University College, Oxford",
        "sentence": "He attended St Ambrose College, a grammar school based in Altrincham, and went on to obtain a first class history degree at University College, Oxford."
    },
    "Steve McCabe": {
        "unis": "Moray House, Edinburgh University of Bradford",
        "sentence": "Born in the shipbuilding town of Port Glasgow on the River Clyde, McCabe attended the Port Glasgow High School before studying at the Moray House College (later named Moray House School of Education, University of Edinburgh) in Edinburgh, where he was awarded a Diploma in Social Studies (Certificate Qualification Social Work) in 1977 and qualified as a social worker.He left the Priory in 1985 and returned to education, taking an MA in Social Work at the University of Bradford in 1986."
    },
    "Kerry McCarthy": {
        "unis": "University of Liverpool|London Guildhall University|University of London",
        "sentence": "McCarthy studied at the University of Liverpool reading Russian Studies, before studying law at City of London Polytechnic."
    },
    "Jason McCartney": {
        "unis": "Leeds Trinity & All Saints",
        "sentence": "After studying for a postgraduate diploma in broadcast journalism at Leeds Trinity & All Saints, McCartney worked as a reporter for BBC Radio Leeds, notably interviewing Northern Ireland Secretary Mo Mowlam in 1997."
    },
    "Karl McCartney": {
        "unis": "University of Wales, Lampeter",
        "sentence": "He gained two A-levels in Geography and Art in 1987.He studied geography at St David's University College in Lampeter (now University of Wales, Lampeter) from 1988 to 1992."
    },
    "Siobhain McDonagh": {
        "unis": "University of Essex",
        "sentence": "McDonagh's father was a builder and her mother a nurse who moved to the area in 1958, she was educated at the Holy Cross School, New Malden and later studied Politics at the University of Essex."
    },
    "Andy McDonald": {
        "unis": "Leeds Polytechnic",
        "sentence": "He attended St. Mary's Sixth Form College before studying a degree in law at Leeds Polytechnic."
    },
    "John McDonnell": {
        "unis": "Brunel University|Birkbeck, University of London",
        "sentence": "After marrying his first wife, he returned to A-level studies at night school at Burnley Technical College, and at the age of 23, he moved to Hayes in Greater London, attended Brunel University, and earned a bachelor's degree in government and politics.After completing his master's degree in politics and sociology at Birkbeck, University of London, he became a researcher and official with the National Union of Mineworkers from 1977 to 1978, and later the Trades Union Congress from 1978 until 1982."
    },
    "Pat McFadden": {
        "unis": "University of Edinburgh",
        "sentence": "McFadden studied Politics at the University of Edinburgh, gaining an undergraduate Master of Arts (MA Hons) degree in 1988, and was chair of Scottish Labour Students in 1986–87 before becoming a researcher in 1988 for Donald Dewar, then Labour's Scottish Affairs spokesman."
    },
    "Conor McGinn": {
        "unis": "Goldsmiths, University of London|London Metropolitan University",
        "sentence": "He studied at Goldsmiths, University of London, but did not initially complete his degree, remaining in London working for a mental health charity for Irish immigrants, Immigrant Counselling and Psychotherapy, and later for the Irish Council for Prisoners Overseas.He later completed his history, politics and Irish studies degree part-time at London Metropolitan University."
    },
    "Alison McGovern": {
        "unis": "University College London",
        "sentence": "She received a Bachelor of Arts in Philosophy from University College London."
    },
    "Catherine McKinnell": {
        "unis": "University of Edinburgh|Northumbria University",
        "sentence": "She studied politics and history at the University of Edinburgh.After leaving Edinburgh, Catherine went on to study Law at Northumbria University."
    },
    "Jim McMahon": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stephen McPartland": {
        "unis": "University of Liverpool|Liverpool John Moores University",
        "sentence": "Born in Liverpool on 9 August 1976, McPartland read History at the University of Liverpool, graduating in 1997.He studied for an MSc in Technology Management at Liverpool John Moores University in 1998."
    },
    "Esther McVey": {
        "unis": "Queen Mary, University of London|City, University of London|Liverpool John Moores University",
        "sentence": "She was privately educated at The Belvedere School before going on to study at Queen Mary University of London and City, University of London.She was educated at the (at that time fee-paying, independent) Belvedere School, before reading law at Queen Mary University of London (LLB) and radio journalism at City, University of London (MA).In July 2009, McVey graduated from Liverpool John Moores University with the degree of Master of Science (MSc) in corporate governance."
    },
    "Ian Mearns": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Mark Menzies": {
        "unis": "University of Glasgow",
        "sentence": "At the University of Glasgow, he was President of the Conservative Association, in 1994 and graduated from the university with an honours degree in economic and social history."
    },
    "Johnny Mercer": {
        "unis": "Royal Military Academy, Sandhurst",
        "sentence": "No Data"
    },
    "Huw Merriman": {
        "unis": "University College, University of Durham|City Law School",
        "sentence": "After graduating, he qualified as a barrister at the City Law School."
    },
    "Stephen Metcalfe": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ed Miliband": {
        "unis": "Corpus Christi College, Oxford London School of Economics",
        "sentence": "Miliband became first a television journalist, then a Labour Party researcher and a visiting scholar at Harvard University, before rising to become one of Chancellor Gordon Brown's confidants and chairman of HM Treasury's Council of Economic Advisers.Born in University College Hospital in Fitzrovia, London, Miliband is the younger son of immigrant parents.His elder brother, David Miliband, still owns the house as of 2010.Ralph Miliband left his academic post at the London School of Economics in 1972 to take up a chair at the University of Leeds as a Professor of Politics.In 1992, after graduating from the University of Oxford, Miliband began his working career in the media as a researcher to co-presenter Andrew Rawnsley in the Channel 4 show A Week in Politics.On 25 July 2002, it was announced that Miliband would take a 12-month unpaid sabbatical from HM Treasury to be a visiting scholar at the Center for European Studies of Harvard University for two semesters.In September 2011, Miliband stated that a future Labour Government would immediately cut the cap on tuition fees for university students from £9,000 per year to £6,000, though he also stated that he remained committed to a graduate tax in the long-run.Oxford: Oxford University Press."
    },
    "Maria Miller": {
        "unis": "London School of Economics",
        "sentence": "She was educated at the Brynteg School before reading Economics at the London School of Economics from where she graduated in 1985."
    },
    "Amanda Milling": {
        "unis": "University College London",
        "sentence": "Milling then studied economics and statistics at University College London, graduating in 1997."
    },
    "Nigel Mills": {
        "unis": "Newcastle University",
        "sentence": "He went on to study Classics at Newcastle University."
    },
    "Nav Mishra": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Mitchell": {
        "unis": "Jesus College, Cambridge",
        "sentence": "Mitchell studied History at Jesus College, Cambridge, where he was elected President of the Cambridge Union in 1978.Speaking in January 2018, to the Jesus College, Cambridge, Debating Society, Mitchell expressed the belief that the Labour would win the next general election and Jeremy Corbyn would become the next Prime Minister."
    },
    "Gagan Mohindra": {
        "unis": "King's College London",
        "sentence": "Mohindra read Mathematics at King's College London and worked in financial services, before founding the Chromex Group four years after graduating, where he worked until 2015."
    },
    "Damien Moore": {
        "unis": "University of Central Lancashire",
        "sentence": "He studied history at the University of Central Lancashire."
    },
    "Robbie Moore": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Layla Moran": {
        "unis": "Imperial College London Brunel University London Institute of Education",
        "sentence": "She studied Physics at Imperial College London and completed her PGCE at Brunel University London.From 2000 to 2003, she studied physics at Imperial College London, and from 2005 to 2007 completed a PGCE at Brunel University London."
    },
    "Penny Mordaunt": {
        "unis": "University of Reading",
        "sentence": "Mordaunt read philosophy at the University of Reading, before working in the public relations industry.Mordaunt read philosophy at the University of Reading, graduating in 1995 with upper second class honours.Mordaunt met Paul Murray when they were both students at the University of Reading and married him in 1999, but that ended in divorce the following year."
    },
    "Helen Morgan": {
        "unis": "Trinity College, Cambridge",
        "sentence": "She attended Alleyne's High School in Stone, before reading history at Trinity College, Cambridge, and graduating in 1996.Morgan is a chartered accountant, and, prior to being elected to parliament, was working as financial controller for a real estate business based in North Shropshire."
    },
    "Stephen Morgan": {
        "unis": "University of Bristol|Goldsmiths, University of London",
        "sentence": "He studied politics and sociology at the University of Bristol before gaining a master's degree in politics at Goldsmiths in London."
    },
    "Anne Marie Morris": {
        "unis": "Hertford College, Oxford",
        "sentence": "She was privately educated at Bryanston School in Dorset and the University of Oxford, where she studied law."
    },
    "David Morris": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Grahame Morris": {
        "unis": "Newcastle College|Newcastle Polytechnic",
        "sentence": "No Data"
    },
    "James Morris": {
        "unis": "University of Birmingham|Wadham College, Oxford|Cranfield School of Management",
        "sentence": "Morris was privately educated at Nottingham High School, an independent school for boys in his home city of Nottingham, followed by  the University of Birmingham, where he obtained a degree in English Literature.He then undertook Postgraduate research at Wadham College, Oxford.He later studied at Cranfield School of Management."
    },
    "Joy Morrissey": {
        "unis": "London School of Economics",
        "sentence": "Morrissey has been a Lord Commissioner of the Treasury since November 2023.Morrissey grew up in the United States, moving to the United Kingdom in 2008 to attend the London School of Economics.Morrissey received a master's degree specialising in European Social Policy from the London School of Economics."
    },
    "Jill Mortimer": {
        "unis": "Teesside University",
        "sentence": "She attended Parklands Girls High School and later read law at Teesside University as a mature student at the age of 50, studying alongside two of her three children."
    },
    "Wendy Morton": {
        "unis": "Open University",
        "sentence": "She later gained an MBA with the Open University."
    },
    "Kieran Mullan": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Holly Mumby-Croft": {
        "unis": "Lincoln University",
        "sentence": "She attended Sir John Nelthorpe School in Brigg and Brigg Sixth-Form College followed by reading English and History at the University of Lincoln."
    },
    "James Murray": {
        "unis": "Wadham College, Oxford",
        "sentence": "He grew up in West Ealing, attending an private school, before studying PPE at Wadham College, Oxford."
    },
    "Sheryll Murray": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Murrison": {
        "unis": "University of Bristol|Britannia Royal Naval College, Dartmouth|Hughes Hall, Cambridge",
        "sentence": "Having been awarded a Royal Navy scholarship, Murrison qualified as a doctor from the University of Bristol's medical school in 1984.The son of William Gordon Murrison RD and Marion Murrison, Murrison was born in Colchester and grew up in Harwich, Essex, where he attended the local Harwich High School (now Harwich and Dovercourt High School), and the Britannia Royal Naval College, Dartmouth.During his naval career he served as an Honorary Research Registrar at Southampton General Hospital and spent one year as a postgraduate student at Hughes Hall, Cambridge, obtaining a Diploma in Public Health."
    },
    "Lisa Nandy": {
        "unis": "Newcastle University Birkbeck, University of London",
        "sentence": "Nandy was born in Manchester and educated at Parrs Wood High School and Holy Cross College before studying politics at Newcastle University and public policy at Birkbeck, University of London.She studied politics at Newcastle University, graduating in 2001, and obtained a master's degree in public policy from Birkbeck, University of London.Winchester University Press."
    },
    "Bob Neill": {
        "unis": "London School of Economics",
        "sentence": "He took his law degree at the London School of Economics and subsequently worked as a barrister specialising in criminal law."
    },
    "Charlotte Nichols": {
        "unis": "University of Liverpool",
        "sentence": "As a teenager, Nichols had one of her earliest experiences of politics when she helped run after-school UK Youth Parliament activities with future Conservative Prime Minister Theresa May.Nichols studied politics at the University of Liverpool, graduating in 2013.Nichols was a women's officer for Young Labour."
    },
    "Lia Nici": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Caroline Nokes": {
        "unis": "University of Sussex",
        "sentence": "Nokes was educated at The Romsey School, La Sagesse Convent in Romsey and then Peter Symonds' College, Winchester, before reading politics at the University of Sussex from 1991 to 1994.After her graduation Nokes became a policy adviser to her father, in his role as a MEP."
    },
    "Jesse Norman": {
        "unis": "Merton College, Oxford|University College London",
        "sentence": "Norman was educated at Eton College and Merton College, Oxford, graduating with a Second in Classics.Norman was a director at Barclays before leaving the City in 1997 to research and teach at University College London.Norman pursued further studies at University College London, where he was appointed an Honorary Research Fellow in philosophy, taking an Master of Philosophy (MPhil) in 1999 and a Doctor of Philosophy (PhD) in 2003.He also lectured in philosophy at University College London and Birkbeck, University of London."
    },
    "Alex Norris": {
        "unis": "University of Nottingham",
        "sentence": "He moved to Nottingham in 2003 to study at the University of Nottingham."
    },
    "Neil O'Brien": {
        "unis": "Christ Church, Oxford",
        "sentence": "He was educated at All Saints High School and Greenhead College, both in Huddersfield, before studying philosophy, politics and economics at Christ Church, Oxford."
    },
    "Matthew Offord": {
        "unis": "Nottingham Trent University|Lancaster University|King's College London",
        "sentence": "He attended Amery Hill School and then studied Geography at Nottingham Trent University.Offord also obtained a master's degree in Environment, Culture and Society from Lancaster University in 2000, and a PhD in Geography from King's College London.Offord also obtained a master's degree in Environment, Culture and Society from Lancaster University in 2000, and a PhD in Geography from King's College London."
    },
    "Sarah Olney": {
        "unis": "King's College London",
        "sentence": "She was educated at All Hallows Catholic School in Farnham and then studied English Literature and Language at King's College London."
    },
    "Chi Onwurah": {
        "unis": "Imperial College London Manchester Business School",
        "sentence": "Her father, from Nigeria, was working as a dentist while he studied at Newcastle University Medical School when they met and married in the 1950s.She also joined the Advisory Board of the Open University Business School.External links ==\n\nOfficial website\nProfile at Parliament of the United Kingdom\nContributions in Parliament at Hansard\nVoting record at Public Whip\nRecord in Parliament at TheyWorkForYou\nChi Onwurah talk at the University of Edinburgh for the Global Challenges Lab/Practical Action, Spring 2016"
    },
    "Guy Opperman": {
        "unis": "University of Buckingham University of Lille",
        "sentence": "Opperman has a degree in law from the University of Buckingham and a first-class diploma from the University of Lille, in France."
    },
    "Abena Oppong-Asare": {
        "unis": "University of Kent",
        "sentence": "Oppong-Asare is of Ghanaian descent and studied Politics with International Relations at the University of Kent, where she also attained a master's degree in International Law with International Relations."
    },
    "Kate Osamor": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Kate Osborne": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Taiwo Owatemi": {
        "unis": "University of Kent",
        "sentence": "Owatemi has a Master's degree from the University of Kent and is qualified as a pharmacist."
    },
    "Sarah Owen": {
        "unis": "University of Sussex",
        "sentence": "Owen graduated from the University of Sussex."
    },
    "Priti Patel": {
        "unis": "University of Keele University of Essex",
        "sentence": "She was educated at Keele University and the University of Essex.Her father Sushil was a UKIP candidate for Hertfordshire in 2013.Patel attended a comprehensive school in Watford before going on to study economics at Keele University.She then pursued postgraduate studies in British government and politics at the University of Essex."
    },
    "Mark Pawsey": {
        "unis": "Reading University",
        "sentence": "He later attended the University of Reading, where he earned a degree in estate management."
    },
    "Stephanie Peacock": {
        "unis": "Queen Mary University of London University College London",
        "sentence": "She obtained a degree in history from Queen Mary University of London, and a master's degree from the Institute of Education, University College London."
    },
    "Mike Penning": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Matthew Pennycook": {
        "unis": "London School of Economics Balliol College, Oxford",
        "sentence": "No Data"
    },
    "John Penrose": {
        "unis": "Downing College, Cambridge|Columbia Business School",
        "sentence": "He was privately educated at Ipswich School and studied at Downing College, Cambridge, receiving a BA in law in 1986.He received an MBA from Columbia Business School, New York in 1991."
    },
    "Andrew Percy": {
        "unis": "University of York|University of Leeds",
        "sentence": "He attended the all-boys (11–16) comprehensive William Gee School  (now part of Endeavour High School) and is a politics graduate of the University of York and studied at Leeds University on a law conversion course  He then worked as a secondary school history teacher in several schools, including in the United States and Canada."
    },
    "Toby Perkins": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jess Phillips": {
        "unis": "University of Leeds|University of Birmingham",
        "sentence": "Phillips studied economic and social history and social policy at the University of Leeds from 2000 to 2003.From 2011 to 2013, she studied for a postgraduate diploma in public sector management at the University of Birmingham."
    },
    "Bridget Phillipson": {
        "unis": "Hertford College, Oxford",
        "sentence": "She went on to read modern history at the University of Oxford's Hertford College, from which she graduated in 2005.She joined Labour as a member at fifteen years old  and in 2003, she was elected Co-Chair of the Oxford University Labour Club.After university, she returned to the north east, where she worked for two years in local government, and then between 2007 and 2010, was a manager at Wearside Women in Need.She met her husband in Newcastle upon Tyne after she graduated from the University of Oxford, and has two children."
    },
    "Chris Philp": {
        "unis": "University College, Oxford",
        "sentence": "==\nChristopher Philp was born in West Wickham, London, and attended St Olave's Grammar School in Orpington, Kent, before studying physics at University College, Oxford."
    },
    "Sarah Edwards": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Luke Pollard": {
        "unis": "University of Exeter",
        "sentence": "Pollard was educated at Tavistock College and Christleton High School before studying politics at the University of Exeter, graduating with first-class honours in 2001."
    },
    "Daniel Poulter": {
        "unis": "University of Bristol LLB|King's College London MBBS, AKC",
        "sentence": "He was privately educated at Vinehall School and Battle Abbey School before attending the University of Bristol, graduating with a law degree, before qualifying as a medical doctor at King's College London.During the 2011 parliamentary summer recesses, Poulter worked at the James Paget University Hospital in Gorleston, in the Accident and Emergency department."
    },
    "Rebecca Pow": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Lucy Powell": {
        "unis": "Somerville College, Oxford|King's College London",
        "sentence": "She studied Chemistry at Somerville College, Oxford, and King's College London.She studied Chemistry at Somerville College, Oxford, and King's College London."
    },
    "Victoria Prentis": {
        "unis": "Royal Holloway, University of London|Downing College, Cambridge",
        "sentence": "She was educated at Royal Holloway, University of London and Downing College, Cambridge, gaining degrees in English and Law respectively.She was educated at Royal Holloway, University of London and Downing College, Cambridge, gaining degrees in English and Law respectively."
    },
    "Mark Pritchard": {
        "unis": "London Guildhall University",
        "sentence": "Mark Maslin, professor of Earth system science at University College London claims Linden Energy is a classic climate denier."
    },
    "Tom Pursglove": {
        "unis": "Queen Mary University of London",
        "sentence": "He was educated at Sir Christopher Hatton School, a state comprehensive school in Wellingborough, and graduated from Queen Mary University of London in 2010 with a politics degree."
    },
    "Jeremy Quin": {
        "unis": "Hertford College, Oxford",
        "sentence": "Educated at St Albans School, Hertfordshire, Quin went to Hertford College, Oxford."
    },
    "Will Quince": {
        "unis": "Aberystwyth University",
        "sentence": "He studied Law between 2001 and 2005 at Aberystwyth University."
    },
    "Yasmin Qureshi": {
        "unis": "Polytechnic of the South Bank University College London",
        "sentence": "She attended what is now London South Bank University, and graduated with a BA (Hons) Law degree before studying for and sitting her examinations for the Bar at the Council of Legal Education.She gained a Master of Laws at University College London."
    },
    "Dominic Raab": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Tom Randall": {
        "unis": "University of Oxford",
        "sentence": "He studied law at Oxford University, going on to practise as a solicitor for two years."
    },
    "Angela Rayner": {
        "unis": "Stockport College",
        "sentence": "She later trained in social care at Stockport College and worked for the local council as a care worker.She later studied part-time at Stockport College, learning British Sign Language, and gaining an NVQ Level 2 in social care."
    },
    "John Redwood": {
        "unis": "Magdalen College, Oxford St Antony's College, Oxford All Souls College, Oxford",
        "sentence": "No Data"
    },
    "Steve Reed": {
        "unis": "University of Sheffield",
        "sentence": "He went on to study English at Sheffield University."
    },
    "Jacob Rees-Mogg": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ellie Reeves": {
        "unis": "St Catherine's College, Oxford",
        "sentence": "She then studied law at St Catherine's College, Oxford, graduating with a bachelor's degree."
    },
    "Rachel Reeves": {
        "unis": "New College, Oxford|London School of Economics",
        "sentence": "Reeves studied at New College, Oxford and the London School of Economics before working as an economist at the Bank of England, the British Embassy in Washington, D.C., and HBOS.After sitting A-Levels in Politics, Economics, Mathematics and Further Mathematics, she read Philosophy, Politics and Economics at New College, Oxford (MA), achieving a 2:1.In June 2023, it was announced that Reeves was elected as an Honorary Fellow of New College, Oxford.Reeves studied at New College, Oxford and the London School of Economics before working as an economist at the Bank of England, the British Embassy in Washington, D.C., and HBOS.She then graduated with an MSc in Economics from the London School of Economics."
    },
    "Jonathan Reynolds": {
        "unis": "University of Manchester|BPP Law School",
        "sentence": "He moved to Manchester in 1998, studying Politics and Modern History at the University of Manchester and BPP Law School (Manchester).He moved to Manchester in 1998, studying Politics and Modern History at the University of Manchester and BPP Law School (Manchester)."
    },
    "Bell Ribeiro-Addy": {
        "unis": "University of Bradford Queen Mary University of London BPP Law School",
        "sentence": "She went on to graduate with a Bachelor of Science degree in Biomedical Science with Ethics & Philosophy of Science from the University of Bradford in 2006.She then completed a Master of Arts degree in Medical Law & Ethics at Queen Mary University of London, awarded in 2007, and a Graduate Diploma in Law at BPP Law School, awarded in 2015.She was the National Black Students' Officer for the National Union of Students (NUS) from 2008 to 2010, national co-ordinator of the Student Assembly Against Racism, and the national convenor of the NUS' Anti-Racism/Anti-Fascism campaign."
    },
    "Nicola Richards": {
        "unis": "University of Birmingham",
        "sentence": "Richards studied politics at the University of Birmingham, graduating with an upper second class degree in 2016."
    },
    "Angela Richardson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Marie Rimmer": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Laurence Robertson": {
        "unis": "Bolton Institute of Higher Education",
        "sentence": "He the studied at Bolton Institute of Higher Education (now the University of Bolton), gaining a diploma in Management Services."
    },
    "Mary Robinson": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Matt Rodda": {
        "unis": "University of Sussex",
        "sentence": "He attended the University of Sussex in the 1980s and trained as a journalist with Thomson."
    },
    "Andrew Rosindell": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Lee Rowley": {
        "unis": "Lincoln College, Oxford|University of Manchester",
        "sentence": "Rowley became the first member of his family to attend university in 1999, when he won an exhibition to study Modern History at Lincoln College, Oxford.He then read for a master's degree, also in history, at the University of Manchester."
    },
    "Dean Russell": {
        "unis": "De Montfort University",
        "sentence": "He later graduated with a BSc in Physics and Business Studies and an MPhil in Physics and Material Science at De Montfort University."
    },
    "Lloyd Russell-Moyle": {
        "unis": "University of Bradford|University of Sussex",
        "sentence": "He studied at the University of Bradford and the University of Sussex.He studied at the University of Bradford and the University of Sussex."
    },
    "David Rutley": {
        "unis": "London School of Economics|Harvard University",
        "sentence": "He was educated at the comprehensive Priory School, Lewes, before going on to study at the London School of Economics and Harvard Business School."
    },
    "Gary Sambrook": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Selaine Saxby": {
        "unis": "Magdalene College, Cambridge",
        "sentence": "She attended Eastbourne Sixth Form College, before studying mathematics and management at Magdalene College, Cambridge, where she gained a BA First Class Honours degree in Maths and Management Studies in 1992.She founded the independent sports bra retailer Lessbounce Ltd. in 2000, and ran the business until 2016, when it went into liquidation."
    },
    "Paul Scully": {
        "unis": "University of Reading",
        "sentence": "He later studied at the University of Reading."
    },
    "Bob Seely": {
        "unis": "King's College London",
        "sentence": "He then studied at King's College London."
    },
    "Andrew Selous": {
        "unis": "London School of Economics",
        "sentence": "He then studied at the London School of Economics, receiving a BSc in Industry and Trade in 1984."
    },
    "Naz Shah": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Grant Shapps": {
        "unis": "Manchester Polytechnic",
        "sentence": "He subsequently completed a business and finance course at Manchester Polytechnic, and received a Higher National Diploma."
    },
    "Alok Sharma": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Virendra Sharma": {
        "unis": "London School of Economics",
        "sentence": "Virendra Kumar Sharma was born on 5 April 1947 in Mandhali, Nawanshahr in the Punjab Province of British India (now Mandhali, Shaheed Bhagat Singh Nagar district, Punjab, India) into a Punjabi Hindu Brahmin family and received his education at the London School of Economics on a trade union scholarship."
    },
    "Barry Sheerman": {
        "unis": "London School of Economics|University of London",
        "sentence": "He graduated from the London School of Economics (BSc Economics 1965) and from the University of London (MSc 1967).He graduated from the London School of Economics (BSc Economics 1965) and from the University of London (MSc 1967)."
    },
    "Alec Shelbrooke": {
        "unis": "Brunel University",
        "sentence": "Born in 1976 in Bromley, South London, Shelbrooke was educated at St George's Church of England School in Gravesend, and graduated with a degree in Mechanical Engineering from Brunel University in 1998."
    },
    "Tulip Siddiq": {
        "unis": "University College London King's College London",
        "sentence": "Tulip Siddiq is the daughter of former Dhaka University professor Shafique Ahmed Siddique, and Sheikh Rehana, who gained political asylum in the UK as a teenager.She attended Scholastica, The Royal School, Hampstead, and Mill Hill School before completing her undergraduate degree in English Literature at University College London and then a master's degree at King's College London."
    },
    "David Simmonds": {
        "unis": "Durham University Birkbeck, University of London",
        "sentence": "He attended Cardinal Newman RC School in Pontypridd, before going to Grey College, University of Durham, where he gained a BA.Simmonds gained a Postgraduate Certificate at Birkbeck College, University of London, and a Financial Planning Certificate from the Chartered Institute of Insurers (CII)."
    },
    "Damien Egan": {
        "unis": "St Mary's University College, Twickenham",
        "sentence": "He studied at St Mary's University College in Twickenham before moving to Lewisham after graduating."
    },
    "Andy Slaughter": {
        "unis": "University of Exeter",
        "sentence": "He studied at the University of Exeter, College of Law, and the Inns of Court School of Law."
    },
    "Cat Smith": {
        "unis": "Lancaster University",
        "sentence": "In 2003, she began studying for a bachelor's degree at Lancaster University.Smith was elected the Women's Officer for Lancaster University Students' Union, a sabbatical role, and served in the 2006–2007 academic year."
    },
    "Chloe Smith": {
        "unis": "University of York",
        "sentence": "After a gap year working for former Conservative Education Secretary Gillian Shephard, she read English Literature at the University of York.After graduating from the University of York, Smith joined Deloitte Touche Tohmatsu as a management consultant."
    },
    "Greg Smith": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Henry Smith": {
        "unis": "University College London",
        "sentence": "He was privately educated at Chinthurst School, Tadworth, Surrey – at the time a boys' preparatory school – then at Frensham Heights School, a co-educational independent school in Farnham in Surrey, followed by University College London, where he obtained a B.A. in Philosophy."
    },
    "Jeff Smith": {
        "unis": "University of Manchester",
        "sentence": "Smith was a pupil at the private Manchester Grammar School, and graduated from the University of Manchester with a degree in Politics and Economics in 1984.He was a member of the University of Manchester Students' Union Executive from 1984 to 1985 as the Entertainments Officer."
    },
    "Julian Smith": {
        "unis": "University of Birmingham",
        "sentence": "He was educated at Balfron High School, a comprehensive school to the west of Stirling, followed by a sixth-form bursary to Millfield School, an independent school in South West England, and the University of Birmingham, where he read English and History."
    },
    "Royston Smith": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Karin Smyth": {
        "unis": "University of East Anglia University of Bath",
        "sentence": "Smyth was educated at Bishopshalt School, Uxbridge College, the University of East Anglia (BA, 1988) where she was President of the Union of UEA Students, and the University of Bath (MBA, 1995)."
    },
    "Alex Sobel": {
        "unis": "University of Leeds",
        "sentence": "After graduating in information systems at the University of Leeds in 1997, Sobel worked with social enterprises, and ran the regional body Social Enterprise Yorkshire and the Humber from 2009 until 2017."
    },
    "Amanda Solloway": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "John Spellar": {
        "unis": "St Edmund Hall, Oxford",
        "sentence": "Spellar was born in Bromley and educated at Dulwich College and St Edmund Hall, Oxford."
    },
    "Ben Spencer": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Mark Spencer": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Alexander Stafford": {
        "unis": "St Benet's Hall, Oxford",
        "sentence": "Stafford studied History at St Benet's Hall, Oxford where he served as president of the Oxford University Conservative Association (in Michaelmas Term of 2007), as president of The Newman Society (in Hilary Term of 2006), and on the executive of the Oxford University Student Union."
    },
    "Keir Starmer": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Stephenson": {
        "unis": "Royal Holloway, University of London",
        "sentence": "Stephenson was the first in his family to go to university and studied for a degree in Management Studies at Royal Holloway, University of London, graduating in 2002."
    },
    "Jane Stevenson": {
        "unis": "Guildhall School of Music",
        "sentence": "Having performed with local orchestras while studying at Wolverhampton Girls' High School, she won an entrance scholarship to the Guildhall School of Music in London."
    },
    "John Stevenson": {
        "unis": "University of Dundee",
        "sentence": "Stevenson was state educated at Aberdeen Grammar School and graduated from the University of Dundee with Honours in History and Politics."
    },
    "Bob Stewart": {
        "unis": "Royal Military Academy Sandhurst",
        "sentence": "He was privately educated at Chigwell School, followed by the Royal Military Academy Sandhurst near Camberley in Surrey.Stewart was accepted for officer training at the age of seventeen, and after two years of training at the Royal Military Academy Sandhurst, was commissioned into the Cheshire Regiment as a second lieutenant on 25 July 1969."
    },
    "Iain Stewart": {
        "unis": "Exeter University",
        "sentence": "He was educated at the state sector Chatelherault Primary School in Hamilton and then privately educated at Hutchesons' Grammar School and studied politics at the University of Exeter before training as an accountant with Coopers & Lybrand in Milton Keynes between 1993 and 1994.Stewart then worked for the Scottish Conservative Party between 1994 and 1998 as Head of Research, before moving to work for a research unit (the Parliamentary Resources Unit) in Westminster, firstly as Deputy Director and finally as Director between 1998 and 2006."
    },
    "Gary Streeter": {
        "unis": "King's College London",
        "sentence": "Streeter attended Tiverton Grammar School, Tiverton, Devon, where he was head boy from 1972 to 1973, then King's College London, where he gained a first-class honours law degree."
    },
    "Wes Streeting": {
        "unis": "Selwyn College, Cambridge",
        "sentence": "He went on to study history at Selwyn College, University of Cambridge.Streeting came out as gay in his second year of university.He served as Selwyn College's Junior Common Room (JCR) President, in which capacity he was a member of Cambridge University Students' Union (CUSU) Council.Shortly after his election as NUS President, Streeting was appointed as a member of the government's Youth Citizenship Commission, chaired by Professor Jonathan Tonge of the University of Liverpool, which published its report in June 2009.Streeting supported university tuition fees as President, consistent with UK government policy during the New Labour years.Official website\n\nProfile at Parliament of the United Kingdom\nContributions in Parliament at Hansard\nVoting record at Public Whip\nRecord in Parliament at TheyWorkForYou\nCouncillor Wes Streeting Archived 24 April 2020 at the Wayback Machine, Redbridge London Borough Council\nInterview with Tiger Television at Birmingham City University\nAppearances on C-SPAN"
    },
    "Mel Stride": {
        "unis": "St Edmund Hall, Oxford",
        "sentence": "He was educated at Portsmouth Grammar School, and then read Philosophy, Politics and Economics at St Edmund Hall, Oxford, where he was elected President of the Oxford Union."
    },
    "Graham Stringer": {
        "unis": "University of Sheffield",
        "sentence": "After graduating in Chemistry from the University of Sheffield in 1971, Stringer worked as an analytical chemist in the plastics industry."
    },
    "Graham Stuart": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Julian Sturdy": {
        "unis": "Harper Adams University",
        "sentence": "No Data"
    },
    "Zarah Sultana": {
        "unis": "University of Birmingham",
        "sentence": "She then went on to study International Relations and Economics at the University of Birmingham."
    },
    "Rishi Sunak": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "James Sunderland": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Desmond Swayne": {
        "unis": "University of St Andrews",
        "sentence": "He studied Theology at St Mary's College at the University of St Andrews."
    },
    "Robert Syms": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Sam Tarry": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Derek Thomas": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Gareth Thomas": {
        "unis": "Aberystwyth University Thames Polytechnic King's College London",
        "sentence": "He gained a Bachelor of Science (BsC) degree in Economics from Aberystwyth University, graduating in 1988.Thomas organised Harrow's first university fair at Whitmore High School in 2016, allowing students to engage with leading universities within the UK and abroad."
    },
    "Emily Thornberry": {
        "unis": "University of Kent",
        "sentence": "After graduating from the University of Kent in Canterbury, she worked as a human rights lawyer from 1985 to 2005 and joined the Transport and General Workers' Union.She went on to study law at the University of Kent in Canterbury, graduating in 1982, and afterwards led the students' union as an elected full-time officer."
    },
    "Maggie Throup": {
        "unis": "University of Manchester",
        "sentence": "She graduated from the University of Manchester with a BSc."
    },
    "Stephen Timms": {
        "unis": "Emmanuel College, Cambridge",
        "sentence": "He was educated at Farnborough Grammar School in Farnborough, Hampshire, and read mathematics at Emmanuel College, Cambridge, where he gained a degree in mathematics in 1977 and an MPhil in operational research in 1978.Before entering politics, Timms worked in the telecommunications industry for 15 years, first for Logica from 1978 to 1986, and then for Ovum from 1986 to 1994, where he worked as a manager responsible for producing reports on the future of telecommunications."
    },
    "Edward Timpson": {
        "unis": "Durham University",
        "sentence": "He then attended Durham University (Hatfield College), where he gained a BA (Hons) in Politics, and the University of Law in London, where he gained a law degree (LLB).Timpson was called to the Bar of England & Wales in 1998."
    },
    "Kelly Tolhurst": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Justin Tomlinson": {
        "unis": "Oxford Brookes",
        "sentence": "He studied at Harry Cheshire High School, a state comprehensive in Kidderminster, Worcestershire, and Oxford Brookes University, where he was chairman of its Conservative Student Branch from 1995 to 1999."
    },
    "Michael Tomlinson": {
        "unis": "King's College London",
        "sentence": "His father Howard was the headmaster of the school between 1987 and 2005.He studied Classics at King's College London before obtaining a Postgraduate Diploma in Law at the College of Law."
    },
    "Craig Tracey": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Anne-Marie Trevelyan": {
        "unis": "Oxford Polytechnic",
        "sentence": "She subsequently studied at Oxford Polytechnic."
    },
    "Jon Trickett": {
        "unis": "University of Hull|University of Leeds",
        "sentence": "He received a BA in Politics from the University of Hull, and later an MA in Political Sociology from the University of Leeds.He received a BA in Politics from the University of Hull, and later an MA in Political Sociology from the University of Leeds."
    },
    "Laura Trott": {
        "unis": "Pembroke College, Oxford",
        "sentence": "She attended Oxted School before studying history and economics at Pembroke College, Oxford."
    },
    "Liz Truss": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Steve Tuckwell": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Tom Tugendhat": {
        "unis": "University of Bristol Gonville and Caius College, Cambridge",
        "sentence": "He was educated at St Paul's School, London, an all-boys private school, before studying theology at the University of Bristol.Following university, he briefly served as a journalist at the Lebanese newspaper The Daily Star.Tugendhat is an Honorary Professor in the Strategy and Security Institute at the University of Exeter."
    },
    "Karl Turner": {
        "unis": "University of Hull Northumbria University",
        "sentence": "He returned to education in the late 1990s to study A Levels at Hull College, before graduating with a law degree as a mature student from the University of Hull in 2004.He became a barrister in 2005 after passing the Bar Vocational Course at Northumbria University and went on to practice criminal law for the Max Gold Partnership in Hull."
    },
    "Derek Twigg": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Liz Twist": {
        "unis": "Aberystwyth University",
        "sentence": "She attended the Notre Dame High School (now De La Salle School, St Helens) and studied at Aberystwyth University."
    },
    "Shailesh Vara": {
        "unis": "Brunel University",
        "sentence": "Educated at Aylesbury Grammar School and Brunel University, Vara qualified as a solicitor."
    },
    "Valerie Vaz": {
        "unis": "Bedford College, University of London",
        "sentence": "She attended the University of London, where she completed a BSc (Hons) degree in Biochemistry in 1978."
    },
    "Martin Vickers": {
        "unis": "University of Lincoln",
        "sentence": "He gained a politics degree at the University of Lincoln after six years as a part-time student in 2004.In 1979, he stood as a Conservative candidate for the Cromwell ward on Great Grimsby Borough Council, but was not successful."
    },
    "Matt Vickers": {
        "unis": "Teesside University",
        "sentence": "He studied law and business management at Teesside University and previously worked at Woolworths and Home Bargains including in a management role."
    },
    "Theresa Villiers": {
        "unis": "University of Bristol Jesus College, Oxford City Law School",
        "sentence": "Villiers gained a Bachelor of Laws (LLB) degree with first-class honours in 1990 from the University of Bristol, and a year later the postgraduate degree of Bachelor of Civil Law (BCL) from Jesus College, Oxford.After university, she qualified for the bar at the Inner Temple, and worked as a lecturer at King's College London from 1994 until 1999."
    },
    "Christian Wakeford": {
        "unis": "Lancaster University|Open University",
        "sentence": "After graduating with a third class degree in politics at Lancaster University, Wakeford was employed as an indirect account manager at a telecoms company for four years, from October 2009 to October 2013.Concurrently, Wakeford undertook an undergraduate degree in chemistry through the Open University from 2010 to 2014.In an interview with Insurance Age in March 2020, which described him as an \"[i]nsurance broker turned Conservative MP\", Wakeford said \"his time in the insurance industry\" gave him \"experience of the real world\" and \"the communication skills needed to speak to businesses\"."
    },
    "Charles Walker": {
        "unis": "University of Oregon",
        "sentence": "Born in Henley-on-Thames in September 1967, Walker was privately educated at The American School in London, followed by the University of Oregon in the United States, receiving a Bachelor of Science in Political Science in 1990.Walker pursued a career in marketing and communications and held senior positions within a number of businesses."
    },
    "Robin Walker": {
        "unis": "Balliol College, Oxford",
        "sentence": "Robin Walker was born in London, and was educated at St Paul's School, an independent school for boys in Barnes in West London, followed by a scholarship at Balliol College, Oxford, where he read Ancient and Modern History."
    },
    "Ben Wallace": {
        "unis": "Royal Military Academy Sandhurst",
        "sentence": "After training as a cadet at the Royal Military Academy Sandhurst, in June 1991 Wallace was commissioned into the Scots Guards as a second lieutenant, with a short service commission."
    },
    "Matt Warman": {
        "unis": "Durham University",
        "sentence": "He then studied English at Durham University."
    },
    "Giles Watling": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Suzanne Webb": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Claudia Webbe": {
        "unis": "De Montfort University Birkbeck, University of London",
        "sentence": "She studied Social Science at Leicester Polytechnic, a professional qualification in Community and Youth Work at the University of Birmingham and a PG Diploma in Socio-Legal Studies (Children) at the University of Nottingham, followed by Race and Ethnic Relations at Birkbeck, University of London."
    },
    "Catherine West": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Andrew Western": {
        "unis": "University of Sheffield",
        "sentence": "He had four sisters, and describes his upbringing as \"modest\", saying that \"after my parents' divorce times were tough\"; he benefited from the Education Maintenance Allowance and was the first member of his family to go to university.He attended the local grammar school, Altrincham Grammar School for Boys, before studying History and Politics at Sheffield University, graduating in 2006.He returned to Trafford after university, and prior to becoming council leader worked in project management within the engineering sector, focusing particularly on transport infrastructure."
    },
    "Matt Western": {
        "unis": "University of Bristol",
        "sentence": "Western was educated in St Albans and graduated with a BSc degree in Geography from the University of Bristol in 1984.Prior to entering politics, Western worked in various senior management roles during a 24-year career with Peugeot both in the UK and Paris, France."
    },
    "Helen Whately": {
        "unis": "Lady Margaret Hall, Oxford",
        "sentence": "Lightwood studied Philosophy, Politics and Economics at Lady Margaret Hall, Oxford, and was a member of debating society the Oxford Union, but she did not have any interest in student politics, later saying that she felt that it \"did not seem to be about getting stuff done\"."
    },
    "Heather Wheeler": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Alan Whitehead": {
        "unis": "University of Southampton",
        "sentence": "He studied Politics and Philosophy at the University of Southampton, where he became President of University of Southampton Students' Union and received a PhD in Political Science."
    },
    "Mick Whitley": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Craig Whittaker": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "John Whittingdale": {
        "unis": "University College London",
        "sentence": "Whittingdale was privately educated at both Sandroyd School and Winchester College, followed by University College London (UCL) where he was Chairman of UCL Conservative Society."
    },
    "Nadia Whittome": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Bill Wiggin": {
        "unis": "Bangor University",
        "sentence": "He attended Eton College, where he was an older contemporary of David Cameron, and later read Economics at the Bangor University, gaining a Bachelor of Arts (Hons) in 1988."
    },
    "James Wild": {
        "unis": "Queen Mary University of London",
        "sentence": "He attended Manor Road Primary School, the fee-paying Norwich School, and later studied at Queen Mary College, University of London, where he obtained a BA in politics in 1998.In 1999, he became Head of Information and Research at the Communication Group, holding the role until 2001."
    },
    "Gavin Williamson": {
        "unis": "University of Bradford",
        "sentence": "Williamson was born in Scarborough, North Yorkshire, and was educated at Raincliffe School, Scarborough Sixth Form College and the University of Bradford.From 1994 to 1997, he completed a BSc in Social Sciences from the University of Bradford."
    },
    "Munira Wilson": {
        "unis": "St Catharine's College, Cambridge",
        "sentence": "She then went on to study at St Catharine's College, Cambridge from 1996 to 2000, where she graduated with a degree in Modern Languages (French and German), including a year abroad as an English assistant in two secondary schools in southern France."
    },
    "Rosie Winterton": {
        "unis": "University of Hull",
        "sentence": "She then read for a BA in history at the University of Hull, which she graduated with in 1979."
    },
    "Mike Wood": {
        "unis": "Aberystwyth University|Cardiff University",
        "sentence": "He attended Old Swinford Hospital – a state-run boarding school in Oldswinford, before studying Economics & Law at Aberystwyth University.He completed a Bar Vocational Course at Cardiff University in 1999."
    },
    "William Wragg": {
        "unis": "University of Manchester",
        "sentence": "He attended Poynton High School before gaining a first-class degree in history from the University of Manchester."
    },
    "Jeremy Wright": {
        "unis": "University of Exeter",
        "sentence": "Wright was educated at two independent schools: Taunton School and Trinity School, New York City, before going to the University of Exeter, where he graduated as a Bachelor of Laws."
    },
    "Mohammad Yasin": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Jacob Young": {
        "unis": "Teesside University",
        "sentence": "After this, he obtained a Higher National Certificate in chemical engineering at Teesside University."
    },
    "Nadhim Zahawi": {
        "unis": "University College London",
        "sentence": "Zahawi was educated at Holland Park School, before moving to Ibstock Place School and then at King's College School, an independent school in Wimbledon, London, followed by University College London, where he earned a BSc degree in chemical engineering in 1988."
    },
    "Daniel Zeichner": {
        "unis": "King's College, Cambridge",
        "sentence": "Zeichner met Barbara \"Budge\" Ziolkowska, his life partner, when he was a student at King's College, Cambridge, in 1976."
    }
}