{
    "Tonia Antoniazzi": {
        "unis": "University of Exeter",
        "sentence": "After studying French and Italian at Exeter University, she gained a Postgraduate Certificate in Education (PGCE) from Cardiff University."
    },
    "Sarah Atherton": {
        "unis": "Liverpool University",
        "sentence": "She left Christleton High School in Chester, a local comprehensive school, at the age of 16.Atherton joined the army, serving in the Intelligence Corps, before training at Bangor University and becoming a Registered General Nurse.She also studied at Manchester Metropolitan University, receiving a BSc (Hons) in Community Health (Specialist District Nurse), and at the University of Liverpool, where she obtained a Masters in Social Work."
    },
    "Simon Baynes": {
        "unis": "Magdalene College, Cambridge",
        "sentence": "He was privately educated at both Belhaven Hill Preparatory School and Shrewsbury School, before going up to Magdalene College, Cambridge, where he completed a BA in History."
    },
    "Kevin Brennan": {
        "unis": "Pembroke College, Oxford|Cardiff University|University of South Wales",
        "sentence": "He was educated at St Alban's RC High School in Pontypool and Pembroke College, Oxford, graduating with a degree in Philosophy, Politics and Economics in 1982.He finished his education with a master's degree in Education Management at the University of Glamorgan (now the University of South Wales) in 1992."
    },
    "Chris Bryant": {
        "unis": "Mansfield College, Oxford Ripon College Cuddesdon",
        "sentence": "Although initially a member of the Conservative Party, and an elected office-holder in the Oxford University Conservative Association, he joined the Labour Party in 1986 after leaving Oxford."
    },
    "Alun Cairns": {
        "unis": "University of Wales, Newport",
        "sentence": "He completed an MBA at University of Wales, Newport (now University of South Wales)."
    },
    "Stephen Crabb": {
        "unis": "University of Bristol|University of London",
        "sentence": "This alludes to popular Chemistry Professor Jon Sharpe who most notably discovered the boiling and melting point of Element 117.Crabb went on to study politics at the University of Bristol and graduated in 1995.They met whilst studying at the University of Bristol."
    },
    "Virginia Crosbie": {
        "unis": "Queen Mary University of London|University of Westminster",
        "sentence": "She studied microbiology at Queen Mary University of London before completing a diploma in management studies at the University of Westminster.She studied microbiology at Queen Mary University of London before completing a diploma in management studies at the University of Westminster."
    },
    "Wayne David": {
        "unis": "University College, Cardiff University College, Swansea",
        "sentence": "He grew up in the village of Cefn Cribwr and later attended Cynffig Comprehensive School before attending Cardiff University, where he was awarded a BA in History and Welsh History in 1979.After studying Economic History at Swansea University, he returned to Cardiff and qualified as a teacher in 1983 with a PGCE from University College Cardiff."
    },
    "David Davies": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Geraint Davies": {
        "unis": "Jesus College, Oxford",
        "sentence": "He was brought up in Cardiff where he attended Llanishen High School, before studying Mathematics then Philosophy, Politics and Economics at Jesus College, Oxford where he was Junior Common Room President."
    },
    "James Davies": {
        "unis": "Christ's College, Cambridge",
        "sentence": "He was educated at the private King's School, Chester before going on to study at Christ's College, Cambridge, gaining three degrees: a BA, a MB BChir in 2004, and an MA in 2005."
    },
    "Alex Davies-Jones": {
        "unis": "Cardiff University",
        "sentence": "She attended Tonyrefail Primary School, Tonyrefail Comprehensive School and graduated from Cardiff University with a joint honours degree in Law and Politics."
    },
    "David Davis": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stephen Doughty": {
        "unis": "Corpus Christi College, Oxford University of St Andrews",
        "sentence": "He went to university at Corpus Christi College, Oxford University, from which he graduated with an upper second-class degree in Philosophy, Politics and Economics, was a member of an all-male singing group, Out of the Blue.He also studied at  the University of St Andrews."
    },
    "Jonathan Edwards": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Chris Elmore": {
        "unis": "Cardiff Metropolitan University",
        "sentence": "He started his working life as a trainee butcher and later attended Cardiff Metropolitan University completing a degree in History and Culture in 2005."
    },
    "Chris Evans": {
        "unis": "Trinity College, Carmarthen",
        "sentence": "He graduated with a history degree from Trinity College, Carmarthen."
    },
    "Nia Griffith": {
        "unis": "Somerville College, Oxford|Bangor University",
        "sentence": "Griffith was born in Dublin, Republic of Ireland, on 4 December 1956.She was educated at Newland High School for Girls (now called Newland School for Girls) in Hull and Somerville College, Oxford where she graduated with a first class degree in modern languages in 1979.Griffith was a founder member of a local Women's Aid organisation and is a member of the National Union of Teachers and the Union of Shop, Distributive and Allied Workers."
    },
    "Carolyn Harris": {
        "unis": "Swansea University",
        "sentence": "She attended Swansea University from 1994 to 1998, where she studied a joint degree in Social History and Social Policy."
    },
    "Simon Hart": {
        "unis": "Royal Agricultural College",
        "sentence": "He was privately educated at Radley College before attending the Royal Agricultural College in Cirencester."
    },
    "David Jones": {
        "unis": "University College London|University of Law",
        "sentence": "He was educated at Ruabon Grammar School, University College London – where he was an active member of UCL Conservative Society – and  Chester College of Law."
    },
    "Fay Jones": {
        "unis": "King's College London",
        "sentence": "She studied French at King's College London."
    },
    "Gerald Jones": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Ruth Jones": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Stephen Kinnock": {
        "unis": "Queens' College, Cambridge College of Europe",
        "sentence": "No Data"
    },
    "Ben Lake": {
        "unis": "Trinity College, Oxford",
        "sentence": "After graduating from Trinity College, Oxford, with an undergraduate degree in History and Politics, and a master's degree in Modern British and European History, he became a Research Officer in the National Assembly for Wales."
    },
    "Anna McMorrin": {
        "unis": "University of Southampton|Cardiff University",
        "sentence": "Having joined the Labour Party as a student, McMorrin graduated from the University of Southampton in 1994 with a BA in French and Politics.In 1997, she graduated from Cardiff University, with a post-graduate diploma in journalism."
    },
    "Robin Millar": {
        "unis": "University of Manchester",
        "sentence": "No Data"
    },
    "Jessica Morden": {
        "unis": "University of Birmingham",
        "sentence": "Morden was born in Surrey, England and brought up in Cwmbran and educated at Croesyceiliog School before reading Medieval and Modern History (BA) at University of Birmingham."
    },
    "Christina Rees": {
        "unis": "University of Wales",
        "sentence": "No Data"
    },
    "Rob Roberts": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Liz Saville Roberts": {
        "unis": "Aberystwyth University",
        "sentence": "==\nElizabeth Saville Roberts grew up in Eltham, London, before moving to Aberystwyth to study languages at Aberystwyth University."
    },
    "Nick Smith": {
        "unis": "Birkbeck, University of London",
        "sentence": "Nick went on to study at Birkbeck College, University of London, where he graduated with an MSc in Economic Change."
    },
    "Jo Stevens": {
        "unis": "University of Manchester|Manchester Metropolitan|University",
        "sentence": "She studied law at Manchester University and completed the Solicitors' Professional Examination at Manchester Polytechnic in 1989.Prior to becoming an MP, Stevens was People and Organisation Director of Thompsons Solicitors."
    },
    "Mark Tami": {
        "unis": "University of Wales, Swansea",
        "sentence": "Born in Enfield, north London, Tami was educated at Enfield Grammar School (by then a comprehensive school), and graduated in history at the University of Wales, Swansea."
    },
    "Nick Thomas-Symonds": {
        "unis": "St Edmund Hall, Oxford",
        "sentence": "He then studied Philosophy, Politics and Economics at St Edmund Hall, Oxford, between 1998 and 2001, where he gained a first.==\nThomas-Symonds was appointed a tutor at St Edmund Hall, Oxford at the age of 21."
    },
    "Jamie Wallis": {
        "unis": "Christ Church, Oxford Cardiff University",
        "sentence": "In 2014, he was awarded a doctorate in astrobiology from Cardiff University, focusing on evidence for cometary panspermia, supervised by Chandra Wickramasinghe."
    },
    "Craig Williams": {
        "unis": "No Data",
        "sentence": "No Data"
    },
    "Hywel Williams": {
        "unis": "University College of South Wales and Monmouthshire",
        "sentence": "He studied Psychology at the University College of South Wales and Monmouthshire (now Cardiff University) before qualifying as a social worker at University College of North Wales (now Bangor University) in 1977/78."
    },
    "Beth Winter": {
        "unis": "University of Bristol Swansea University",
        "sentence": "She graduated with a Bachelor of Science in Social Policy and a Master of Arts in Housing Studies, both from the University of Bristol.She later became a researcher and received a PhD from Swansea University in disadvantage among older people in rural communities.She is an official for the University and College Union."
    }
}